{
  "head": {
    "title": "Створення діаграм у файлах {{FileFormatUp}} з {{ProgLang}}",
    "description": "API {{ProdFullName}} дозволяє розробникам динамічно генерувати та вставляти діаграми або графіки в документи, використовуючи дані в реальному часі."
  },
  "header": {
    "title": "Вбудовування діаграм у файли {{FileFormatUp}} за допомогою API {{EnvNameShort}}",
    "description": "{{ProdFullName}} надає потужний спосіб заповнення файлів {{FileFormatUp}} динамічними даними та бездоганної інтеграції діаграм.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Спробуйте безкоштовно"
  },
  "about": {
    "title": "Що таке {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це інструмент, розроблений для спрощення створення документів і звітів, що інтегрує дані з різних джерел. Генеруйте діаграми, таблиці, списки, штрих-коди та зображення динамічно. Розширені параметри форматування дозволяють точно розміщувати та налаштовувати ваш контент. Підтримує понад 50 форматів файлів, включаючи PDF, документи MS Office та електронні листи."
  },
  "more_features": {
    "title": "Додавайте динамічні діаграми до своїх документів без зусиль",
    "description": "{{ProdFullName}} спрощує створення документів, керованих даними, у широко використовуваних форматах. Використовуйте шаблони для вставки діаграм, таблиць, штрих-кодів, списків, гіперпосилань та зображень з розширеною інтеграцією даних.",
    "image_description": "Ключові можливості {{ProdShortName}}",
    "feature_1": {
      "title": "Перетворюйте дані на професійні діаграми",
      "content": "Перетворюйте дані з JSON, XML, CSV та інших джерел на візуально привабливі діаграми всього за кілька кроків, використовуючи наш API."
    },
    "feature_2": {
      "title": "Створюйте візуально привабливий контент",
      "content": "{{ProdShortName}} підтримує кілька типів діаграм, таких як графіки стовпців, кругові діаграми та лінійні графіки. Поєднуйте їх з таблицями, штрих-кодами, зображеннями та іншими елементами для створення професійних звітів."
    },
    "feature_3": {
      "title": "Точно розміщуйте та налаштовуйте діаграми",
      "content": "З синтаксисом LINQ ви можете динамічно генерувати та розміщувати діаграми точно там, де необхідно. Легко налаштовуйте стилі, кольори та макети відповідно до ваших вимог."
    },
    "feature_4": {
      "title": "Працює з різними форматами файлів",
      "content": "Створюйте документи в популярних форматах, таких як MS Office, PDF, OpenOffice та HTML. Встроюйте діаграми без зусиль у будь-який підтримуваний формат з повною сумісністю."
    }
  },
  "formats": {
    "title": "Створюйте візуально багаті звіти в кількох форматах",
    "description": "{{EnvName}} дозволяє генерувати документи з інтегрованими діаграмами в понад 50 підтримуваних форматах, поєднуючи шаблони з вашими даними без труднощів."
  },
  "operations": {
    "title": "Відкрийте для себе ключові можливості",
    "description": "Наша платформа допоможе вам створити привабливі, керовані даними документи, адаптовані до ваших потреб."
  },
  "examples": {
    "comment_1": "Додайте цей тег до свого шаблону, щоб згенерувати діаграму",
    "comment_2": "Вкажіть шлях до файлу шаблону",
    "comment_3": "Завантажте дані з обраного джерела",
    "comment_4": "Збережіть документ із вбудованою діаграмою"
  },
  "steps": {
    "title": "Як додати діаграму до документа {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) спрощує генерування та вбудовування діаграм у ваші шаблони {{FileFormatUp}}. Підтримує різноманітні типи діаграм, такі як стовпчикові, кругові та лінійні.",
      "step_1": "Створіть шаблон {{FileFormatUp}} з запланованими місцями для діаграм.",
      "step_2": "Отримайте свої дані з сумісного джерела.",
      "step_3": "Визначте параметри діаграми, такі як тип, мітки та кольорова схема.",
      "step_4": "Збережіть оновлений файл із вбудованою діаграмою."
    }
  },
  "code_1": {
    "title": "Створення діаграми програмно",
    "content": "Цей приклад демонструє, як динамічно створити та вбудувати діаграму в документ {{FileFormatUp}}.",
    "comment_1": "Підготуйте шаблон із запланованим місцем для діаграми",
    "comment_2": "Надайте шлях до файлу шаблону",
    "comment_3": "Отримайте дані з вашого джерела",
    "comment_4": "Сформуйте об'єкт даних з необхідною інформацією",
    "comment_5": "Встановіть властивості діаграми, такі як тип та зовнішній вигляд",
    "comment_6": "Ініціалізуйте {{DocumentAssembler}}",
    "comment_7": "Експортуйте документ з вбудованою діаграмою"
  },
  "texts_pdf": {
    "step_1": "Створіть шаблон із призначеними місцями для діаграми (шаблони PDF не підтримуються).",
    "step_4": "Експортуйте документ з діаграмою у форматі PDF.",
    "comment_tmp": "В даний час шаблони PDF не підтримуються."
  }
}