{
  "head": {
    "title": "Create charts in {{FileFormatUp}} files with {{ProgLang}}",
    "description": "The {{ProdFullName}} API makes it easy for developers to generate and insert charts or graphs into documents dynamically using real-time data."
  },
  "header": {
    "title": "Embed charts in {{FileFormatUp}} files with {{EnvNameShort}} API",
    "description": "{{ProdFullName}} provides a powerful way to populate {{FileFormatUp}} files with dynamic data and integrate charts effortlessly.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Try Free"
  },
  "about": {
    "title": "What is {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is a tool designed to streamline the creation of documents and reports by integrating data from various sources. Easily generate charts, tables, lists, barcodes, and images dynamically. Advanced formatting options allow precise placement and customization of your content. It supports over 50 file formats, including PDFs, MS Office documents, and emails."
  },
  "more_features": {
    "title": "Add dynamic charts to your documents effortlessly",
    "description": "{{ProdFullName}} simplifies the creation of data-driven documents in widely-used formats. Use templates to insert charts, tables, barcodes, lists, hyperlinks, and images with advanced, dynamic data integration.",
    "image_description": "Key features of {{ProdShortName}}",
    "feature_1": {
      "title": "Convert data into professional charts",
      "content": "Turn data from JSON, XML, CSV, and other sources into visually appealing charts with just a few steps using our API."
    },
    "feature_2": {
      "title": "Create visually engaging content",
      "content": "{{ProdShortName}} supports multiple chart types like bar graphs, pie charts, and line graphs. Combine these with tables, barcodes, images, and other elements to create professional reports."
    },
    "feature_3": {
      "title": "Precisely position and customize charts",
      "content": "With LINQ syntax, you can dynamically generate and place charts exactly where needed. Easily customize styles, colors, and layout to match your requirements."
    },
    "feature_4": {
      "title": "Works with various file formats",
      "content": "Produce documents in popular formats like MS Office, PDF, OpenOffice, and HTML. Embed charts seamlessly into any supported format with full compatibility."
    }
  },
  "formats": {
    "title": "Create visually rich reports in multiple formats",
    "description": "{{EnvName}} allows you to generate documents with integrated charts across 50+ supported formats, combining templates with your data seamlessly."
  },
  "operations": {
    "title": "Discover key capabilities",
    "description": "Our platform helps you create compelling, data-driven documents tailored to your needs."
  },
  "examples": {
    "comment_1": "Include this tag in your template to generate a chart",
    "comment_2": "Specify the file path for your template",
    "comment_3": "Load data from your preferred source",
    "comment_4": "Save the document with the chart embedded"
  },
  "steps": {
    "title": "How to add a chart to a {{FileFormatUp}} document",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) makes it simple to generate and embed charts into your {{FileFormatUp}} templates. Supports a variety of chart types, such as bar, pie, and line charts.",
      "step_1": "Design a {{FileFormatUp}} template with placeholders for the charts.",
      "step_2": "Retrieve your data from a compatible source.",
      "step_3": "Define chart options like type, labels, and color scheme.",
      "step_4": "Save the updated file with the chart embedded."
    }
  },
  "code_1": {
    "title": "Create a chart programmatically",
    "content": "This example demonstrates how to dynamically create and embed a chart into a {{FileFormatUp}} document.",
    "comment_1": "Prepare a template with a placeholder for the chart",
    "comment_2": "Provide the path to the template file",
    "comment_3": "Retrieve the data from your source",
    "comment_4": "Build a data object with the necessary information",
    "comment_5": "Set up chart properties such as type and appearance",
    "comment_6": "Initialize {{DocumentAssembler}}",
    "comment_7": "Export the document with the chart included"
  },
  "texts_pdf": {
    "step_1": "Design a template with designated spots for the chart (PDF templates are not supported).",
    "step_4": "Export the document with the chart as a PDF file.",
    "comment_tmp": "Currently, PDF templates are not supported."
  }
}
