{
  "head": {
    "title": "{{ProgLang}} สร้างกราฟในไฟล์ {{FileFormatUp}}",
    "description": "API {{ProdFullName}} ช่วยให้นักพัฒนาสามารถสร้างและแทรกรูปกราฟหรือกราฟลงในเอกสารโดยอัตโนมัติด้วยข้อมูลเรียลไทม์."
  },
  "header": {
    "title": "แทรกรูปกราฟในไฟล์ {{FileFormatUp}} ด้วย API {{EnvNameShort}}",
    "description": "{{ProdFullName}} มอบวิธีการที่ทรงพลังในการเติมข้อมูลที่เป็นพลศาสตร์ลงในไฟล์ {{FileFormatUp}} และรวมกราฟได้อย่างราบรื่น.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้งานฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่ออกแบบมาเพื่อทำให้การสร้างเอกสารและรายงานมีความเรียบง่ายโดยการรวมข้อมูลจากแหล่งข้อมูลที่หลากหลาย สามารถสร้างกราฟ, ตาราง, รายการ, บาร์โค้ดและภาพได้โดยอัตโนมัติ ตัวเลือกการตั้งค่าขั้นสูงช่วยให้สามารถจัดวางและปรับแต่งเนื้อหาของคุณได้อย่างแม่นยำ สนับสนุนไฟล์มากกว่า 50 รูปแบบ รวมถึง PDF, เอกสาร MS Office และอีเมล."
  },
  "more_features": {
    "title": "เพิ่มกราฟพลศาสตร์ลงในเอกสารของคุณได้อย่างราบรื่น",
    "description": "{{ProdFullName}} ทำให้การสร้างเอกสารที่ขับเคลื่อนด้วยข้อมูลในรูปแบบที่ใช้กันทั่วไปเป็นไปอย่างสะดวก ใช้เทมเพลตเพื่อแทรกรูปกราฟ, ตาราง, บาร์โค้ด, รายการ, ลิงก์และภาพด้วยการรวมข้อมูลที่เป็นพลศาสตร์อย่างก้าวหน้ากว่า.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "แปลงข้อมูลเป็นกราฟมืออาชีพ",
      "content": "เปลี่ยนข้อมูลจาก JSON, XML, CSV, และแหล่งข้อมูลอื่น ๆ ให้เป็นกราฟที่น่าดึงดูดด้วยขั้นตอนง่าย ๆ โดยใช้ API ของเรา."
    },
    "feature_2": {
      "title": "สร้างเนื้อหาที่ดึงดูดสายตา",
      "content": "{{ProdShortName}} รองรับประเภทกราฟหลายแบบ เช่น กราฟแท่ง, กราฟวงกลม, และกราฟเส้น รวมเข้ากับตาราง, บาร์โค้ด, ภาพ และองค์ประกอบอื่น ๆ เพื่อสร้างรายงานระดับมืออาชีพ."
    },
    "feature_3": {
      "title": "จัดวางและปรับแต่งกราฟอย่างแม่นยำ",
      "content": "ด้วยไวยากรณ์ LINQ คุณสามารถสร้างและวางกราฟที่จำเป็นได้ตามต้องการ ปรับแต่งสไตล์, สี และรูปแบบให้ตรงกับความต้องการของคุณได้อย่างง่ายดาย."
    },
    "feature_4": {
      "title": "ทำงานกับรูปแบบไฟล์ที่หลากหลาย",
      "content": "ผลิตเอกสารในรูปแบบที่นิยมเช่น MS Office, PDF, OpenOffice และ HTML แทรกรูปกราฟได้อย่างราบรื่นในรูปแบบที่รองรับทั้งหมด."
    }
  },
  "formats": {
    "title": "สร้างรายงานที่มีภาพลักษณ์หลากหลายรูปแบบ",
    "description": "{{EnvName}} ช่วยให้คุณสร้างเอกสารที่มีกราฟที่รวมอยู่ในรูปแบบที่รองรับมากกว่า 50 รูปแบบ โดยการรวมเทมเพลตกับข้อมูลของคุณอย่างราบรื่น."
  },
  "operations": {
    "title": "ค้นพบความสามารถหลัก",
    "description": "แพลตฟอร์มของเราช่วยให้คุณสร้างเอกสารที่น่าดึงดูดและขับเคลื่อนด้วยข้อมูลที่ปรับแต่งตามความต้องการของคุณ."
  },
  "examples": {
    "comment_1": "รวมแท็กนี้ในเทมเพลตของคุณเพื่อสร้างกราฟ",
    "comment_2": "ระบุเส้นทางไฟล์สำหรับเทมเพลตของคุณ",
    "comment_3": "โหลดข้อมูลจากแหล่งที่คุณต้องการ",
    "comment_4": "บันทึกเอกสารที่แทรกรูปกราฟแล้ว"
  },
  "steps": {
    "title": "วิธีการเพิ่มกราฟลงในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การสร้างและแทรกรูปกราฟลงในเทมเพลต {{FileFormatUp}} เป็นเรื่องง่าย รองรับประเภทกราฟที่หลากหลาย เช่น กราฟแท่ง, กราฟวงกลม และกราฟเส้น.",
      "step_1": "ออกแบบเทมเพลต {{FileFormatUp}} โดยมีพื้นที่สำหรับกราฟ.",
      "step_2": "ดึงข้อมูลจากแหล่งข้อมูลที่รองรับ.",
      "step_3": "กำหนดตัวเลือกกราฟ เช่น ประเภท, แท็ก และโทนสี.",
      "step_4": "บันทึกไฟล์ที่อัปเดตพร้อมกราฟที่แทรกอยู่."
    }
  },
  "code_1": {
    "title": "สร้างกราฟโดยโปรแกรม",
    "content": "ตัวอย่างนี้แสดงวิธีการสร้างและแทรกรูปกราฟในเอกสาร {{FileFormatUp}} โดยอัตโนมัติ.",
    "comment_1": "เตรียมเทมเพลตพร้อมพื้นที่สำหรับกราฟ",
    "comment_2": "ระบุเส้นทางไปยังไฟล์เทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งที่คุณเลือก",
    "comment_4": "สร้างอ็อบเจ็กต์ข้อมูลที่มีข้อมูลที่จำเป็น",
    "comment_5": "ตั้งค่าคุณสมบัติของกราฟ เช่น ประเภทและลักษณะ",
    "comment_6": "เริ่มต้น {{DocumentAssembler}}",
    "comment_7": "ส่งออกเอกสารพร้อมกราฟที่รวมอยู่"
  },
  "texts_pdf": {
    "step_1": "ออกแบบเทมเพลตพร้อมจุดที่กำหนดสำหรับกราฟ (เทมเพลต PDF ไม่ได้รับการสนับสนุน).",
    "step_4": "ส่งออกเอกสารพร้อมกราฟเป็นไฟล์ PDF.",
    "comment_tmp": "ขณะนี้ไม่สนับสนุนเทมเพลต PDF."
  }
}