{
  "head": {
    "title": "Создание графиков в файлах {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "API {{ProdFullName}} упрощает для разработчиков процесс генерации и вставки графиков или диаграмм в документы динамически с использованием данных в реальном времени."
  },
  "header": {
    "title": "Встраивание графиков в файлы {{FileFormatUp}} с помощью API {{EnvNameShort}}",
    "description": "{{ProdFullName}} предлагает мощный способ заполнить файлы {{FileFormatUp}} динамическими данными и без труда интегрировать графики.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Попробуйте бесплатно"
  },
  "about": {
    "title": "Что такое {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) – это инструмент, предназначенный для упрощения создания документов и отчетов путем интеграции данных из различных источников. Генерируйте графики, таблицы, списки, штрих-коды и изображения динамически. Расширенные параметры форматирования позволяют точно размещать и настраивать ваш контент. Он поддерживает более 50 форматов файлов, включая PDF, документы MS Office и электронные письма."
  },
  "more_features": {
    "title": "Добавляйте динамические графики в ваши документы без усилий",
    "description": "{{ProdFullName}} упрощает создание документов на основе данных в широко используемых форматах. Используйте шаблоны для вставки графиков, таблиц, штрих-кодов, списков, гиперссылок и изображений с передовой динамической интеграцией данных.",
    "image_description": "Ключевые функции {{ProdShortName}}",
    "feature_1": {
      "title": "Преобразуйте данные в профессиональные графики",
      "content": "Преобразуйте данные из JSON, XML, CSV и других источников в визуально привлекательные графики всего за несколько шагов с использованием нашего API."
    },
    "feature_2": {
      "title": "Создавайте визуально привлекательный контент",
      "content": "{{ProdShortName}} поддерживает множество типов графиков, таких как столбчатые диаграммы, круговые диаграммы и линейные графики. Объедините их с таблицами, штрих-кодами, изображениями и другими элементами для создания профессиональных отчетов."
    },
    "feature_3": {
      "title": "Точно позиционируйте и настраивайте графики",
      "content": "С помощью синтаксиса LINQ вы можете динамически генерировать и размещать графики именно там, где это необходимо. Легко настраивайте стили, цвета и макет в соответствии с вашими требованиями."
    },
    "feature_4": {
      "title": "Работает с различными форматами файлов",
      "content": "Создавайте документы в популярных форматах, таких как MS Office, PDF, OpenOffice и HTML. Встраивайте графики без особых усилий в любой поддерживаемый формат с полной совместимостью."
    }
  },
  "formats": {
    "title": "Создавайте визуально насыщенные отчеты в нескольких форматах",
    "description": "{{EnvName}} позволяет вам генерировать документы с интегрированными графиками в более чем 50 поддерживаемых форматах, без проблем комбинируя шаблоны с вашими данными."
  },
  "operations": {
    "title": "Откройте для себя ключевые возможности",
    "description": "Наша платформа помогает вам создавать привлекательные, ориентированные на данные документы, адаптированные к вашим нуждам."
  },
  "examples": {
    "comment_1": "Включите этот тег в свой шаблон для генерации графика",
    "comment_2": "Укажите путь к вашему шаблону",
    "comment_3": "Загрузите данные из предпочитаемого источника",
    "comment_4": "Сохраните документ с встраиваемым графиком"
  },
  "steps": {
    "title": "Как добавить график в документ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) упрощает процесс генерации и встраивания графиков в ваши шаблоны {{FileFormatUp}}. Поддерживаются различные типы графиков, такие как столбчатые, круговые и линейные.",
      "step_1": "Создайте шаблон {{FileFormatUp}} с заполняемыми местами для графиков.",
      "step_2": "Получите ваши данные из совместимого источника.",
      "step_3": "Определите параметры графика, такие как тип, метки и цветовая схема.",
      "step_4": "Сохраните обновленный файл с встроенным графиком."
    }
  },
  "code_1": {
    "title": "Создание графика программным путем",
    "content": "Этот пример демонстрирует, как динамически создать и встроить график в документ {{FileFormatUp}}.",
    "comment_1": "Подготовьте шаблон с заполняемым местом для графика",
    "comment_2": "Укажите путь к файлу шаблона",
    "comment_3": "Получите данные из вашего источника",
    "comment_4": "Сформируйте объект данных с необходимой информацией",
    "comment_5": "Настройте свойства графика, такие как тип и внешний вид",
    "comment_6": "Инициализируйте {{DocumentAssembler}}",
    "comment_7": "Экспортируйте документ с включенным графиком"
  },
  "texts_pdf": {
    "step_1": "Создайте шаблон с определенными местами для графика (шаблоны PDF не поддерживаются).",
    "step_4": "Экспортируйте документ с графиком в файл PDF.",
    "comment_tmp": "В настоящее время шаблоны PDF не поддерживаются."
  }
}