{
  "head": {
    "title": "สร้างแผนภูมิในเอกสาร {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "API {{ProdFullName}} อนุญาตให้นักพัฒนาสร้างและแทรกแผนภูมิหรือกราฟแบบไดนามิกลงในเอกสารได้อย่างราบรื่น โดยใช้ข้อมูลที่มีการอัปเดตแบบเรียลไทม์"
  },
  "header": {
    "title": "เพิ่มแผนภูมิในเอกสาร {{FileFormatUp}} ด้วย API {{EnvNameShort}}",
    "description": "{{ProdFullName}} ช่วยให้ง่ายต่อการฝังแผนภูมิในเอกสาร {{FileFormatUp}} โดยใช้ข้อมูลเรียลไทม์",
    "subtitle": "{{ProdFullName}}",
    "action_title": "เริ่มต้นใช้งานฟรี"
  },
  "about": {
    "title": "บทนำสู่ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันที่หลากหลายสำหรับการสร้างเอกสารและรายงานโดยอัตโนมัติ ช่วยให้คุณสามารถเพิ่มแผนภูมิ ตาราง รายการ บาร์โค้ด และภาพลงในไฟล์ของคุณได้โดยตรง ด้วยเครื่องมือขั้นสูงสำหรับการจัดฟอร์แมตอย่างแม่นยำและการรวมข้อมูล แพลตฟอร์มนี้รองรับมากกว่า 50 รูปแบบ รวมถึง PDF ไฟล์ Microsoft Office และอีเมล"
  },
  "more_features": {
    "title": "ฝังแผนภูมิแบบไดนามิกในเอกสารของคุณได้อย่างราบรื่น",
    "description": "{{ProdFullName}} มอบวิธีการที่เหมาะสมในการสร้างเอกสารที่มีข้อมูลมากมายในรูปแบบที่นิยม ใช้เทมเพลตเพื่อนำเข้าแผนภูมิ ตาราง บาร์โค้ด รายการ ลิงก์ และภาพพร้อมการอัปเดตจากข้อมูลของคุณ",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "แปลงข้อมูลเป็นแผนภูมิได้ง่าย",
      "content": "ใช้ API เพื่อแปลงข้อมูลจาก JSON, XML, CSV หรือแหล่งข้อมูลอื่นเป็นแผนภูมิที่เรียบร้อยและเป็นมืออาชีพสำหรับเอกสารของคุณ"
    },
    "feature_2": {
      "title": "สร้างเนื้อหาที่ชัดเจนและน่าสนใจ",
      "content": "{{ProdShortName}} รองรับรูปแบบการแสดงผลที่หลากหลายรวมถึงกราฟแท่ง แผนภูมิวงกลม และกราฟเส้น ซึ่งสามารถรวมกับตาราง บาร์โค้ด ภาพ และอื่นๆ เพื่อรายงานที่ดียิ่งขึ้น"
    },
    "feature_3": {
      "title": "การจัดวางและการตกแต่งแผนภูมิที่ปรับแต่งได้",
      "content": "ด้วยไวยกรณ์ที่ใช้ LINQ คุณสามารถสร้างและจัดตำแหน่งแผนภูมิในเอกสารได้แบบไดนามิก หมายถึงการปรับปรุงรูปแบบ สี และเค้าโครงตามความต้องการในการออกแบบของคุณ"
    },
    "feature_4": {
      "title": "รองรับรูปแบบเอกสารหลายรูปแบบ",
      "content": "สร้างเอกสารในรูปแบบเช่น MS Office, PDF, OpenOffice และ HTML แผนภูมิจะรวมเข้ากับรูปแบบใด ๆ ที่สนับสนุนเพื่อผลลัพธ์ระดับมืออาชีพ"
    }
  },
  "formats": {
    "title": "สร้างรายงานที่ครอบคลุมในหลายรูปแบบ",
    "description": "{{EnvName}} ช่วยให้คุณสร้างเอกสารที่มีแผนภูมิรวมอยู่ในรูปแบบไฟล์มากกว่า 50 รูปแบบ ทำให้การรวมเทมเพลตและข้อมูลทำได้อย่างราบรื่น"
  },
  "operations": {
    "title": "สำรวจความสามารถที่ทรงพลัง",
    "description": "แพลตฟอร์มนี้ช่วยให้ขั้นตอนการออกแบบเอกสารที่เน้นข้อมูลและน่าดึงดูดตามความต้องการของคุณเป็นเรื่องง่าย"
  },
  "examples": {
    "comment_1": "เพิ่มแท็กนี้ลงในเทมเพลตของคุณเพื่อรวมแผนภูมิ",
    "comment_2": "ระบุเส้นทางไฟล์ไปยังเทมเพลตของคุณ",
    "comment_3": "ดึงข้อมูลที่จำเป็นจากแหล่งข้อมูลของคุณ",
    "comment_4": "บันทึกเอกสารสุดท้ายที่มีแผนภูมิฝังอยู่"
  },
  "steps": {
    "title": "ขั้นตอนในการฝังแผนภูมิในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้ง่ายต่อการแทรกแผนภูมิในเทมเพลต {{FileFormatUp}} ในหลายรูปแบบ รวมถึงกราฟแท่ง แผนภูมิวงกลม และกราฟเส้น",
      "step_1": "สร้างเทมเพลต {{FileFormatUp}} พร้อมโดยใช้ตัวแทนสำหรับแผนภูมิ",
      "step_2": "โหลดข้อมูลของคุณจากแหล่งข้อมูลที่เข้ากันได้",
      "step_3": "ตั้งค่าแผนภูมิ เช่น ประเภท ป้ายชื่อ และสี",
      "step_4": "บันทึกเอกสารที่มีแผนภูมิที่รวมอยู่"
    }
  },
  "code_1": {
    "title": "สร้างและฝังแผนภูมิแบบโปรแกรมmatically",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงวิธีการสร้างและฝังแผนภูมิในเอกสาร {{FileFormatUp}} แบบโปรแกรมmatically",
    "comment_1": "เตรียมเทมเพลตที่มีตัวแทนสำหรับแผนภูมิ",
    "comment_2": "ระบุเส้นทางไฟล์ไปยังเทมเพลต",
    "comment_3": "โหลดข้อมูลจากแหล่งข้อมูลที่คุณเลือก",
    "comment_4": "สร้างวัตถุข้อมูลที่มีข้อมูลที่เกี่ยวข้อง",
    "comment_5": "กำหนดประเภทและรูปลักษณ์ของแผนภูมิ",
    "comment_6": "เริ่มต้น {{DocumentAssembler}}",
    "comment_7": "บันทึกเอกสารที่เสร็จสมบูรณ์พร้อมแผนภูมิที่ฝังอยู่"
  },
  "texts_pdf": {
    "step_1": "สร้างเทมเพลตด้วยตัวแทนสำหรับแผนภูมิ (เทมเพลต PDF ไม่ได้รับการสนับสนุน)",
    "step_4": "บันทึกเอกสารที่มีแผนภูมิเป็นไฟล์ PDF",
    "comment_tmp": "เทมเพลต PDF ไม่ได้รับการสนับสนุนในขณะนี้"
  }
}