{
  "head": {
    "title": "Создавайте списки в документах {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Разработайте и встроите динамические списки в ваши шаблоны {{FileFormatUp}} с помощью API {{ProdFullName}}."
  },
  "header": {
    "title": "Добавьте динамические списки в файлы {{FileFormatUp}} с нашим API {{EnvNameShort}}",
    "description": "{{ProdFullName}} предоставляет гибкие инструменты для создания и вставки насыщенных данными списков прямо в документы {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Попробовать бесплатно"
  },
  "about": {
    "title": "Что такое {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) позволяет легко разрабатывать профессиональные документы, извлекая данные из различных источников. Используйте его для создания списков, таблиц, графиков или текста, размещая эти элементы точно там, где нужно, с помощью расширенных функций шаблонов. С поддержкой более 50 форматов, включая PDF, файлы MS Office и электронные документы, он помогает автоматизировать и оптимизировать рабочий процесс."
  },
  "more_features": {
    "title": "Генерация документов из шаблонов с интеграцией данных",
    "description": "{{ProdFullName}} упрощает добавление динамических списков, таблиц, графиков и других компонентов в шаблоны документов.",
    "image_description": "Ключевые возможности {{ProdShortName}}",
    "feature_1": {
      "title": "Создание отчетов с данными из различных источников",
      "content": "Используйте данные из форматов, таких как JSON, XML и CSV, для эффективного заполнения списков и других компонентов."
    },
    "feature_2": {
      "title": "Бесшовное добавление списков и других элементов данных",
      "content": "{{ProdShortName}} позволяет встраивать списки, графики, таблицы и многое другое вместе с текстом, изображениями и ссылками для создания аккуратных документов."
    },
    "feature_3": {
      "title": "Точный контроль над появлением данных",
      "content": "Шаблоны на базе LINQ позволяют определять точные местоположения для ваших списков и данных. Используйте циклы для автоматического создания детализированных списков и применяйте пользовательское форматирование."
    },
    "feature_4": {
      "title": "Поддержка различных форматов документов",
      "content": "Создавайте или редактируйте файлы в таких форматах, как MS Office, PDF, OpenOffice, HTML и электронная почта. Объединяйте содержимое из нескольких документов по мере необходимости."
    }
  },
  "formats": {
    "title": "Создавайте документы в различных форматах",
    "description": "{{EnvName}} поддерживает более 50 форматов, что позволяет вам создавать структурированные документы, комбинируя данные и шаблоны."
  },
  "operations": {
    "title": "Узнайте, что может {{ProdShortName}}",
    "description": "Легко разрабатывайте и генерируйте документы с богатым содержанием с помощью продвинутых инструментов интеграции данных."
  },
  "examples": {
    "comment_1": "Добавьте этот тег в ваш шаблон, где должен появиться список",
    "comment_2": "Определите путь к файлу шаблона",
    "comment_3": "Извлеките данные из выбранного вами источника",
    "comment_4": "Сохраните документ с встроенным списком"
  },
  "steps": {
    "title": "Как добавить список, основанный на данных, в документ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет вам быстро вставлять насыщенные данными списки в шаблоны {{FileFormatUp}}. Настраивайте и организовывайте содержимое без труда.",
      "step_1": "Создайте шаблон {{FileFormatUp}} и отметьте места для заполнительных мест для списка.",
      "step_2": "Установите путь к файлу шаблона.",
      "step_3": "Получите данные из поддерживаемых форматов, таких как JSON или XML.",
      "step_4": "Сохраните итоговый документ с добавленным списком."
    }
  },
  "code_1": {
    "title": "Как создать список программно",
    "content": "Этот пример показывает, как динамически добавить список в файл {{FileFormatUp}} с помощью {{ProdShortName}}.",
    "comment_1": "Добавьте тег-заполнитель в ваш шаблон для списка",
    "comment_2": "Укажите путь к вашему шаблону",
    "comment_3": "Извлеките необходимые данные для заполнения списка",
    "comment_4": "Подготовьте источник данных с необходимыми деталями",
    "comment_5": "Инициализируйте {{DocumentAssembler}}",
    "comment_6": "Сохраните итоговый документ с завершенным списком"
  },
  "texts_pdf": {
    "step_1": "Разработайте шаблон и укажите заполнители для списка (шаблоны PDF не поддерживаются).",
    "step_4": "Сохраните готовый документ со списком в формате PDF.",
    "comment_tmp": "Шаблоны PDF в настоящее время не поддерживаются."
  }
}