{
  "head": {
    "title": "สร้างรายการในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ออกแบบและแทรกรายการที่มีข้อมูลแบบไดนามิกลงในเทมเพลต {{FileFormatUp}} ของคุณด้วย API {{ProdFullName}}."
  },
  "header": {
    "title": "เพิ่มรายการแบบไดนามิกลงในไฟล์ {{FileFormatUp}} ด้วย API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} ให้เครื่องมือที่ยืดหยุ่นในการสร้างและแทรกข้อมูลที่มีความละเอียดสูงโดยตรงลงในเอกสาร {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ลองใช้งานฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ช่วยให้การออกแบบเอกสารมืออาชีพเป็นเรื่องง่ายโดยดึงข้อมูลจากหลายแหล่ง ใช้เพื่อสร้างรายการ ตาราง แผนภูมิ หรือข้อความ และวางองค์ประกอบเหล่านี้ในตำแหน่งที่ต้องการโดยใช้ฟีเจอร์ของเทมเพลตที่มีความก้าวหน้า มีการสนับสนุนรูปแบบมากกว่า 50 รูปแบบ รวมถึง PDF เอกสาร MS Office และอีเมล เพื่อช่วยในการอัตโนมัตและปรับปรุงกระบวนการทำงานของคุณ."
  },
  "more_features": {
    "title": "สร้างเอกสารจากเทมเพลตโดยมีการรวมข้อมูล",
    "description": "{{ProdFullName}} ทำให้การเพิ่มรายการแบบไดนามิก ตาราง แผนภูมิ และองค์ประกอบอื่นในเทมเพลตเอกสารเป็นเรื่องง่าย.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากข้อมูลหลากหลายแหล่ง",
      "content": "ใช้ข้อมูลจากรูปแบบต่างๆ เช่น JSON, XML และ CSV เพื่อทำการเติมข้อมูลในรายการและองค์ประกอบอื่นๆ ได้อย่างมีประสิทธิภาพ."
    },
    "feature_2": {
      "title": "เพิ่มรายการและแหล่งข้อมูลอื่นๆ อย่างไม่มีสะดุด",
      "content": "{{ProdShortName}} ช่วยให้สามารถฝังรายการ แผนภูมิ ตาราง และอื่นๆ ควบคู่ไปกับข้อความ รูปภาพ และลิงก์เพื่อสร้างเอกสารที่ดูน่าเชื่อถือ."
    },
    "feature_3": {
      "title": "ควบคุมตำแหน่งการปรากฏของข้อมูลอย่างแม่นยำ",
      "content": "เทมเพลตที่ใช้ LINQ ช่วยให้คุณกำหนดตำแหน่งสำหรับรายการและข้อมูลได้อย่างแม่นยำ ใช้ลูปเพื่อสร้างรายการที่ละเอียดอัตโนมัติและปรับใช้การจัดรูปแบบแบบกำหนดเอง."
    },
    "feature_4": {
      "title": "รองรับรูปแบบเอกสารที่หลากหลาย",
      "content": "สร้างหรือแก้ไขไฟล์ในรูปแบบต่างๆ เช่น MS Office, PDF, OpenOffice, HTML และอีเมล รวมเนื้อหาจากเอกสารหลายไฟล์ตามที่ต้องการ."
    }
  },
  "formats": {
    "title": "สร้างเอกสารในรูปแบบต่างๆ",
    "description": "{{EnvName}} รองรับรูปแบบมากกว่า 50 รูปแบบ ทำให้คุณสร้างเอกสารที่มีโครงสร้างโดยการรวมข้อมูลและเทมเพลต."
  },
  "operations": {
    "title": "ค้นพบสิ่งที่ {{ProdShortName}} สามารถทำได้",
    "description": "ออกแบบและสร้างเอกสารที่มีเนื้อหาที่ซับซ้อนได้อย่างง่ายดายด้วยเครื่องมือการรวมข้อมูลที่มีความก้าวหน้า."
  },
  "examples": {
    "comment_1": "เพิ่มแท็กนี้ในเทมเพลตของคุณที่ซึ่งควรมีการแสดงรายการ",
    "comment_2": "กำหนดเส้นทางไฟล์ของเทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งที่เลือกของคุณ",
    "comment_4": "บันทึกเอกสารพร้อมรายการที่ฝังอยู่"
  },
  "steps": {
    "title": "วิธีการเพิ่มรายการที่ขับเคลื่อนด้วยข้อมูลในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณแทรกรายการที่มีข้อมูลอย่างรวดเร็วในเทมเพลต {{FileFormatUp}} ได้อย่างมีประสิทธิภาพและจัดระเบียบเนื้อหาได้ง่าย.",
      "step_1": "สร้างเทมเพลต {{FileFormatUp}} และทำเครื่องหมายจุดแทนสำหรับรายการ.",
      "step_2": "ตั้งค่าเส้นทางไฟล์ไปยังเทมเพลต.",
      "step_3": "ดึงข้อมูลจากรูปแบบที่สนับสนุน เช่น JSON หรือ XML.",
      "step_4": "บันทึกเอกสารสุดท้ายพร้อมรายการที่เพิ่มเข้ามา."
    }
  },
  "code_1": {
    "title": "วิธีการสร้างรายการโดยการเขียนโปรแกรม",
    "content": "ตัวอย่างนี้แสดงวิธีการเพิ่มรายการแบบไดนามิกลงในแฟ้ม {{FileFormatUp}} โดยใช้ {{ProdShortName}}.",
    "comment_1": "เพิ่มแท็กพื้นที่ว่างในเทมเพลตของคุณสำหรับรายการ",
    "comment_2": "ระบุเส้นทางไฟล์ไปยังเทมเพลตของคุณ",
    "comment_3": "ดึงข้อมูลที่ต้องการเพื่อนำเข้ารายการ",
    "comment_4": "จัดเตรียมแหล่งข้อมูลพร้อมรายละเอียดที่จำเป็น",
    "comment_5": "เริ่มต้น {{DocumentAssembler}}",
    "comment_6": "บันทึกเอกสารผลลัพธ์พร้อมรายการที่เสร็จสมบูรณ์"
  },
  "texts_pdf": {
    "step_1": "ออกแบบเทมเพลตและระบุพื้นที่ว่างสำหรับรายการ (ไม่รองรับเทมเพลต PDF).",
    "step_4": "บันทึกเอกสารที่เสร็จสมบูรณ์พร้อมรายการที่แนบมาเป็น PDF.",
    "comment_tmp": "ไม่รองรับเทมเพลต PDF ณ ขณะนี้."
  }
}