{
  "head": {
    "title": "Crie Listas Dinâmicas em {{FileFormatUp}} com {{ProgLang}}",
    "description": "Projete e insira listas em templates {{FileFormatUp}} utilizando a API {{ProdFullName}}."
  },
  "header": {
    "title": "Incorpore Listas Baseadas em Dados em Arquivos {{FileFormatUp}} com {{EnvNameShort}}",
    "description": "{{ProdFullName}} oferece ferramentas poderosas para adicionar listas flexíveis e impulsionadas por dados a documentos {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Comece Grátis"
  },
  "about": {
    "title": "Sobre {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) simplifica a criação de documentos extraindo dados de diversas fontes e incorporando-os em templates. Use-o para construir listas, tabelas, gráficos e outros elementos, com opções de formatação e posicionamento precisas. Suportando mais de 50 formatos, incluindo PDF, MS Office e emails, ajuda a automatizar seu processo de geração de documentos."
  },
  "more_features": {
    "title": "Gere Documentos com Dados Integrados",
    "description": "Com {{ProdFullName}}, você pode incorporar listas, tabelas, gráficos e outros elementos em templates, economizando tempo e esforço.",
    "image_description": "Destaques do {{ProdShortName}}",
    "feature_1": {
      "title": "Gere Relatórios de Múltiplas Fontes de Dados",
      "content": "Importe dados de JSON, XML, CSV ou outros formatos para preencher listas e outros componentes de forma eficiente."
    },
    "feature_2": {
      "title": "Adicione Listas e Outros Elementos Visuais",
      "content": "{{ProdShortName}} permite incorporar listas, tabelas, gráficos e mais ao lado de texto, imagens e links para resultados polidos."
    },
    "feature_3": {
      "title": "Posicione e Estilize Dados Precisamente",
      "content": "Templates baseados em LINQ permitem controlar exatamente onde listas e outros dados aparecem, utilizar loops para itens repetidos e personalizar estilos de acordo com suas necessidades."
    },
    "feature_4": {
      "title": "Funciona em Vários Formatos",
      "content": "Crie documentos em formatos como MS Office, PDF, OpenOffice, HTML e emails. Mescle conteúdo de várias fontes em um único arquivo."
    }
  },
  "formats": {
    "title": "Crie Documentos em Vários Formatos",
    "description": "{{EnvName}} suporta mais de 50 formatos de arquivo, facilitando a fusão de templates e dados em resultados profissionais."
  },
  "operations": {
    "title": "Explore as Funcionalidades do {{ProdShortName}}",
    "description": "Desenhe e gere documentos ricos em dados sem esforço utilizando ferramentas de integração poderosas."
  },
  "examples": {
    "comment_1": "Coloque esta tag em seu template para marcar onde a lista irá.",
    "comment_2": "Defina o caminho do arquivo para seu template.",
    "comment_3": "Busque dados da fonte que deseja usar.",
    "comment_4": "Salve o arquivo com a lista incorporada."
  },
  "steps": {
    "title": "Passos para Inserir uma Lista em um Arquivo {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) facilita a adição de listas detalhadas e baseadas em dados aos seus templates {{FileFormatUp}}.",
      "step_1": "Crie um template {{FileFormatUp}} e defina marcadores de posição para a lista.",
      "step_2": "Forneça o caminho do arquivo do template.",
      "step_3": "Carregue dados de fontes suportadas, como JSON ou XML.",
      "step_4": "Salve o documento com a lista gerada."
    }
  },
  "code_1": {
    "title": "Crie Programaticamente uma Lista em um Documento",
    "content": "Este exemplo demonstra como adicionar dinamicamente uma lista a um documento {{FileFormatUp}} usando {{ProdShortName}}.",
    "comment_1": "Adicione um marcador de posição em seu template para a lista.",
    "comment_2": "Especifique o caminho do arquivo do template.",
    "comment_3": "Carregue dados para preencher a lista.",
    "comment_4": "Prepare a fonte de dados com os detalhes necessários.",
    "comment_5": "Inicialize o {{DocumentAssembler}}.",
    "comment_6": "Salve o documento final com a lista incluída."
  },
  "texts_pdf": {
    "step_1": "Projete um template com marcadores de posição para a lista (templates PDF não são suportados).",
    "step_4": "Exporte o documento finalizado com a lista como um arquivo PDF.",
    "comment_tmp": "Templates PDF atualmente não são suportados."
  }
}