{
  "head": {
    "title": "สร้างรายการในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "API {{ProdFullName}} ช่วยให้นักพัฒนาสามารถสร้างรายการข้อมูลแบบไดนามิกและฝังลงในเอกสารและเทมเพลตได้อย่างสะดวก"
  },
  "header": {
    "title": "เพิ่มรายการที่ขับเคลื่อนด้วยข้อมูลในเอกสาร {{FileFormatUp}} โดยใช้ API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} มอบเครื่องมืออันทรงพลังสำหรับการสร้างและฝังรายการในเอกสาร {{FileFormatUp}} อย่างไดนามิก",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชันทดลองฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ถูกออกแบบมาเพื่อทำให้การสร้างเอกสารและรายงานเป็นเรื่องง่ายด้วยการรวมข้อมูลจากแหล่งต่างๆ ได้อย่างราบรื่น สามารถเติมเทมเพลตด้วยรายการ แผนภูมิ ตาราง บาร์โค้ด หรือข้อความ และวางเนื้อหาอย่างแม่นยำโดยใช้ markup ขั้นสูง รองรับมากกว่า 50 รูปแบบ รวมถึง PDF ไฟล์ MS Office และอีเมล ทำให้เหมาะสมสำหรับการทำงานอัตโนมัติของเอกสาร"
  },
  "more_features": {
    "title": "สร้างเอกสารโดยการเติมเทมเพลตด้วยข้อมูลที่มีโครงสร้าง",
    "description": "{{ProdFullName}} ทำให้การสร้างเอกสารที่ขับเคลื่อนด้วยข้อมูลเป็นเรื่องง่าย เพิ่มรายการ ตาราง บาร์โค้ด แผนภูมิ รูปภาพ และองค์ประกอบอื่นๆ อย่างไดนามิกด้วยเทมเพลตขั้นสูง",
    "image_description": "คุณสมบัติของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากข้อมูลธุรกิจ",
      "content": "API จะเติมเอกสารในรูปแบบที่นิยมโดยใช้ข้อมูลจากแหล่งต่างๆ เช่น JSON, XML, CSV เป็นต้น ด้วยความถูกต้องและมีประสิทธิภาพ"
    },
    "feature_2": {
      "title": "ใช้รายการและองค์ประกอบอื่นๆ เพื่อแสดงข้อมูล",
      "content": "{{ProdShortName}} ช่วยให้คุณฝังรายการ ตาราง และแผนภูมิ พร้อมกับข้อความ บาร์โค้ด ลิงก์ และรูปภาพเพื่อสร้างเอกสารที่มีโครงสร้างได้ดี"
    },
    "feature_3": {
      "title": "แทรกข้อมูลในที่ที่ต้องการได้อย่างแม่นยำ",
      "content": "ใช้ไวยากรณ์ที่อิงจาก LINQ เพื่อกำหนดตำแหน่งรายการและข้อมูลอื่นๆ ได้อย่างแม่นยำ ใช้ลูปเพื่อเติมรายการแบบไดนามิกและใช้การกำหนดรูปแบบที่กำหนดเองในแบบโปรแกรม"
    },
    "feature_4": {
      "title": "รองรับหลายรูปแบบเอกสาร",
      "content": "สร้างและจัดการเอกสารในรูปแบบต่างๆ เช่น MS Office, OpenOffice, PDF, HTML และไฟล์อีเมล รวมหลายเอกสารเข้าด้วยกันได้อย่างง่ายดาย"
    }
  },
  "formats": {
    "title": "สร้างเอกสารที่มีโครงสร้างในรูปแบบที่นิยม",
    "description": "{{EnvName}} รองรับมากกว่า 50 รูปแบบ ทำให้คุณสามารถผสานข้อมูลและเทมเพลตเพื่อผลิตผลลัพธ์ที่มีคุณภาพและมีโครงสร้าง"
  },
  "operations": {
    "title": "สำรวจคุณสมบัติหลัก",
    "description": "แพลตฟอร์มของเราถูกสร้างขึ้นเพื่อทำให้การสร้างและรวมเนื้อหาที่ขับเคลื่อนด้วยข้อมูลในเอกสารเป็นเรื่องง่าย"
  },
  "examples": {
    "comment_1": "เพิ่มแท็กนี้ในเทมเพลตเพื่อมาร์กจุดที่รายการจะปรากฏ",
    "comment_2": "ระบุเส้นทางไปยังไฟล์เทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งที่เลือกของคุณ",
    "comment_4": "บันทึกเอกสารพร้อมกับรายการที่สร้างขึ้น"
  },
  "steps": {
    "title": "ขั้นตอนในการเพิ่มรายการที่เต็มไปด้วยข้อมูลในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การแทรกรายการที่ขับเคลื่อนด้วยข้อมูลในเทมเพลต {{FileFormatUp}} เป็นเรื่องที่ตรงไปตรงมา สร้างและปรับแต่งรายการได้อย่างมีประสิทธิภาพ",
      "step_1": "เตรียมเทมเพลต {{FileFormatUp}} พร้อมช่องว่างสำหรับรายการ",
      "step_2": "ตั้งค่าเส้นทางไปยังเทมเพลต",
      "step_3": "ดึงข้อมูลจากแหล่งที่รองรับ เช่น JSON หรือตัว XML",
      "step_4": "บันทึกเอกสารสุดท้ายพร้อมกับรายการที่ฝังอยู่"
    }
  },
  "code_1": {
    "title": "วิธีสร้างรายการแบบไดนามิก",
    "content": "ตัวอย่างนี้แสดงให้เห็นว่าการฝังรายการที่สร้างขึ้นแบบไดนามิกในเอกสาร {{FileFormatUp}} ทำได้อย่างไร",
    "comment_1": "เพิ่มแท็กตัว placeholder ในเทมเพลตสำหรับรายการ",
    "comment_2": "ระบุเส้นทางไปยังไฟล์เทมเพลต",
    "comment_3": "ดึงข้อมูลเพื่อเติมรายการ",
    "comment_4": "สร้างออบเจ็กต์แหล่งข้อมูลด้วยข้อมูลที่จำเป็น",
    "comment_5": "เริ่มต้น {{DocumentAssembler}}",
    "comment_6": "บันทึกเอกสารสุดท้ายพร้อมกับรายการที่สร้างขึ้น"
  },
  "texts_pdf": {
    "step_1": "สร้างเทมเพลตพร้อมจุดหมายที่กำหนดสำหรับรายการ (เทมเพลต PDF ยังไม่ได้รับการสนับสนุนในขณะนี้)",
    "step_4": "ส่งออกเอกสารที่เสร็จสมบูรณ์พร้อมกับรายการเป็นไฟล์ PDF",
    "comment_tmp": "ยังไม่มีการสนับสนุนสำหรับเทมเพลต PDF ในขณะนี้"
  }
}