{
  "head": {
    "title": "Crea elenchi nei documenti {{FileFormatUp}} utilizzando {{ProgLang}}",
    "description": "Progetta e inserisci facilmente elenchi dinamici nei tuoi modelli {{FileFormatUp}} con l'API {{ProdFullName}}."
  },
  "header": {
    "title": "Aggiungi elenchi dinamici ai file {{FileFormatUp}} con la nostra API {{EnvNameShort}}",
    "description": "{{ProdFullName}} offre strumenti flessibili per generare e inserire elenchi ricchi di dati direttamente nei documenti {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Provalo gratuitamente"
  },
  "about": {
    "title": "Cos'è {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) consente di progettare documenti professionali estraendo dati da più fonti. Utilizzalo per creare elenchi, tabelle, grafici o testo, e posizionare questi elementi esattamente dove necessario utilizzando funzioni avanzate dei modelli. Con supporto per oltre 50 formati, inclusi PDF, file MS Office e documenti email, aiuta ad automatizzare e semplificare il tuo flusso di lavoro."
  },
  "more_features": {
    "title": "Genera documenti da modelli con integrazione dei dati",
    "description": "{{ProdFullName}} semplifica l'aggiunta di elenchi dinamici, tabelle, grafici e altri componenti nei modelli di documento.",
    "image_description": "Caratteristiche principali di {{ProdShortName}}",
    "feature_1": {
      "title": "Crea report con dati provenienti da varie fonti",
      "content": "Utilizza dati provenienti da formati come JSON, XML e CSV per popolare elenchi e altri componenti in modo efficiente."
    },
    "feature_2": {
      "title": "Aggiungi elenchi e altri elementi di dati senza soluzione di continuità",
      "content": "{{ProdShortName}} consente l'inserimento di elenchi, grafici, tabelle e altro, insieme a testo, immagini e link per creare documenti curati."
    },
    "feature_3": {
      "title": "Controlla con precisione dove appaiono i dati",
      "content": "I modelli basati su LINQ consentono di definire posizioni esatte per i tuoi elenchi e i dati. Utilizza loop per creare elenchi dettagliati automaticamente e applica formattazioni personalizzate."
    },
    "feature_4": {
      "title": "Supporta vari formati di documento",
      "content": "Crea o modifica file in formati come MS Office, PDF, OpenOffice, HTML e email. Unisci contenuti da più documenti secondo necessità."
    }
  },
  "formats": {
    "title": "Produci documenti in vari formati",
    "description": "{{EnvName}} supporta oltre 50 formati, permettendoti di creare documenti strutturati combinando dati e modelli."
  },
  "operations": {
    "title": "Scopri cosa può fare {{ProdShortName}}",
    "description": "Progetta e genera facilmente documenti ricchi di contenuti con avanzati strumenti di integrazione dei dati."
  },
  "examples": {
    "comment_1": "Include questo tag nel tuo modello dove deve apparire l'elenco",
    "comment_2": "Definisci il percorso del file del modello",
    "comment_3": "Estrai i dati dalla tua fonte scelta",
    "comment_4": "Salva il documento con l'elenco incorporato"
  },
  "steps": {
    "title": "Come aggiungere un elenco guidato dai dati a un documento {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ti consente di inserire rapidamente elenchi ricchi di dati nei modelli {{FileFormatUp}}. Personalizza e organizza i contenuti senza sforzo.",
      "step_1": "Crea un modello {{FileFormatUp}} e contrassegna i punti di segnaposto per l'elenco.",
      "step_2": "Imposta il percorso del file per il modello.",
      "step_3": "Estrai dati da formati supportati come JSON o XML.",
      "step_4": "Salva il documento finale con l'elenco aggiunto."
    }
  },
  "code_1": {
    "title": "Come creare un elenco programmaticamente",
    "content": "Questo esempio mostra come aggiungere dinamicamente un elenco a un file {{FileFormatUp}} utilizzando {{ProdShortName}}.",
    "comment_1": "Aggiungi un tag segnaposto nel tuo modello per l'elenco",
    "comment_2": "Fornisci il percorso del file per il tuo modello",
    "comment_3": "Estrai i dati richiesti per popolare l'elenco",
    "comment_4": "Prepara la fonte di dati con i dettagli necessari",
    "comment_5": "Inizializza {{DocumentAssembler}}",
    "comment_6": "Salva il documento di output con l'elenco completato"
  },
  "texts_pdf": {
    "step_1": "Progetta un modello e specifica i segnaposto per l'elenco (i modelli PDF non sono supportati).",
    "step_4": "Salva il documento finale con l'elenco incluso come PDF.",
    "comment_tmp": "I modelli PDF non sono supportati al momento."
  }
}