{
  "head": {
    "title": "Генеруйте списки в документах {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "API {{ProdFullName}} дозволяє розробникам динамічно створювати та вбудовувати заповнені даними списки у документи та шаблони."
  },
  "header": {
    "title": "Додавайте списки на основі даних до документів {{FileFormatUp}} за допомогою нашого API {{EnvNameShort}}",
    "description": "{{ProdFullName}} пропонує потужні інструменти для динамічного генерування та вбудовування списків у документи {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачати безкоштовну пробну версію"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) призначений для оптимізації створення документів та звітів через безперешкодну інтеграцію даних з різних джерел. Заповнюйте шаблони списками, діаграмами, таблицями, штрих-кодами або текстом, і точно розміщуйте контент за допомогою розширеного набору розмітки. З підтримкою понад 50 форматів, включаючи PDF, файли MS Office та електронні листи, це ідеальне рішення для автоматизації документних робочих процесів."
  },
  "more_features": {
    "title": "Створюйте документи, заповнюючи шаблони структурованими даними",
    "description": "{{ProdFullName}} спрощує створення документів на основі даних. Додавайте списки, таблиці, штрих-коди, діаграми, зображення та інші елементи динамічно за допомогою розширених шаблонів.",
    "image_description": "Особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Генеруйте звіти на основі бізнес-даних",
      "content": "API заповнює документи в популярних форматах, використовуючи дані з джерел, таких як JSON, XML, CSV тощо, з точністю та ефективністю."
    },
    "feature_2": {
      "title": "Використовуйте списки та інші елементи для представлення даних",
      "content": "{{ProdShortName}} дозволяє вбудовувати списки, таблиці та діаграми разом з текстом, штрих-кодами, гіперпосиланнями та зображеннями для створення добре структурованих документів."
    },
    "feature_3": {
      "title": "Вставляйте дані точно у потрібних місцях",
      "content": "Використовуйте синтаксис на основі LINQ для точного позиціонування списків та інших елементів даних. Використовуйте цикли для динамічного заповнення списків і застосовуйте індивідуальне форматування програмно."
    },
    "feature_4": {
      "title": "Підтримує багаторазові формати документів",
      "content": "Генеруйте та керуйте документами у різних форматах, таких як MS Office, OpenOffice, PDF, HTML та електронні листи. Легко інтегруйте кілька документів в один."
    }
  },
  "formats": {
    "title": "Створюйте структуровані документи в популярних форматах",
    "description": "{{EnvName}} підтримує понад 50 форматів, що дозволяє безперешкодно об'єднувати дані та шаблони для отримання відполірованих і структурованих результатів."
  },
  "operations": {
    "title": "Досліджуйте основні можливості",
    "description": "Наша платформа створена для спрощення створення та інтеграції контенту документів на основі даних."
  },
  "examples": {
    "comment_1": "Додайте цей тег до вашого шаблону, щоб позначити місце, де з'явиться список",
    "comment_2": "Вкажіть шлях до файл-шаблона",
    "comment_3": "Отримайте дані з обраного джерела",
    "comment_4": "Збережіть документ з згенерованим списком"
  },
  "steps": {
    "title": "Кроки для додавання заповненого даними списку до документа {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) спрощує вставлення списків на основі даних у шаблони {{FileFormatUp}}. Створюйте та налаштовуйте списки без зайвих зусиль.",
      "step_1": "Підготуйте шаблон {{FileFormatUp}} з заповнювальниками для списку.",
      "step_2": "Встановіть шлях до шаблону.",
      "step_3": "Отримайте дані з підтримуваних джерел, таких як JSON або XML.",
      "step_4": "Збережіть остаточний документ із вбудованим списком."
    }
  },
  "code_1": {
    "title": "Як динамічно генерувати список",
    "content": "Цей приклад демонструє, як вбудувати динамічно згенерований список у документ {{FileFormatUp}}.",
    "comment_1": "Додайте тег заповнювача до вашого шаблону для списку",
    "comment_2": "Вкажіть шлях до файл-шаблона",
    "comment_3": "Отримайте дані для заповнення списку",
    "comment_4": "Створіть об'єкт джерела даних з необхідною інформацією",
    "comment_5": "Ініціалізуйте {{DocumentAssembler}}",
    "comment_6": "Збережіть остаточний документ із згенерованим списком"
  },
  "texts_pdf": {
    "step_1": "Створіть шаблон з визначеними місцями для списку (шаблони PDF наразі не підтримуються).",
    "step_4": "Експортуйте завершений документ зі списком у форматі PDF.",
    "comment_tmp": "Підтримка шаблонів PDF наразі відсутня."
  }
}