{
  "head": {
    "title": "สร้างรายการแบบไดนามิกใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ออกแบบและแทรกรายการในเทมเพลต {{FileFormatUp}} โดยใช้ API ของ {{ProdFullName}}."
  },
  "header": {
    "title": "แทรกรายการที่ขับเคลื่อนด้วยข้อมูลในไฟล์ {{FileFormatUp}} ด้วย {{EnvNameShort}}",
    "description": "{{ProdFullName}} มอบเครื่องมือที่ทรงพลังในการเพิ่มรายการที่ยืดหยุ่นและขับเคลื่อนด้วยข้อมูลลงในเอกสาร {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "เริ่มต้นใช้งานฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ช่วยให้การสร้างเอกสารเป็นเรื่องง่ายด้วยการดึงข้อมูลจากแหล่งต่าง ๆ และแทรกเข้าไปในเทมเพลต ใช้เพื่อสร้างรายการ ตาราง แผนภูมิ และองค์ประกอบอื่น ๆ พร้อมตัวเลือกในการจัดวางและการจัดรูปแบบที่แม่นยำ รองรับกว่า 50 รูปแบบ รวมทั้ง PDF, MS Office และอีเมล ช่วยให้คุณสามารถทำงานเอกสารอัตโนมัติได้"
  },
  "more_features": {
    "title": "สร้างเอกสารได้อย่างง่ายดายด้วยข้อมูลที่รวมเข้าด้วยกัน",
    "description": "ด้วย {{ProdFullName}} คุณสามารถแทรกรายการ ตาราง แผนภูมิ และองค์ประกอบอื่น ๆ ลงในเทมเพลต ช่วยประหยัดเวลาและความพยายาม.",
    "image_description": "จุดเด่นของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากแหล่งข้อมูลหลายแห่ง",
      "content": "นำเข้าข้อมูลจาก JSON, XML, CSV หรือรูปแบบอื่น ๆ เพื่อนำไปใช้ในการเติมรายการและองค์ประกอบอื่น ๆ ได้อย่างมีประสิทธิภาพ."
    },
    "feature_2": {
      "title": "เพิ่มรายการและองค์ประกอบภาพอื่น ๆ",
      "content": "{{ProdShortName}} ช่วยให้คุณแทรกรายการ ตาราง แผนภูมิ และอื่น ๆ ได้อย่างไร้รอยต่อควบคู่ไปกับข้อความ รูปภาพ และลิงก์เพื่อผลลัพธ์ที่ดูดี."
    },
    "feature_3": {
      "title": "ควบคุมตำแหน่งและสไตล์ข้อมูลอย่างแม่นยำ",
      "content": "เทมเพลตที่ใช้ LINQ ช่วยให้คุณควบคุมได้อย่างแน่ชัดว่ารายการและข้อมูลอื่น ๆ จะปรากฏที่ใด ใช้ลูปสำหรับรายการที่ซ้ำกัน และปรับแต่งสไตล์ให้เหมาะกับความต้องการของคุณ."
    },
    "feature_4": {
      "title": "ทำงานในหลายรูปแบบ",
      "content": "สร้างเอกสารในรูปแบบต่าง ๆ เช่น MS Office, PDF, OpenOffice, HTML และอีเมล รวมเนื้อหาจากแหล่งต่าง ๆ เป็นไฟล์เดียว."
    }
  },
  "formats": {
    "title": "สร้างเอกสารในหลายรูปแบบ",
    "description": "{{EnvName}} รองรับรูปแบบไฟล์มากกว่า 50 รูปแบบ ทำให้การรวมเทมเพลตและข้อมูลเป็นไปอย่างมืออาชีพ."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์ของ {{ProdShortName}}",
    "description": "ออกแบบและสร้างเอกสารที่อุดมไปด้วยข้อมูลได้อย่างง่ายดายด้วยเครื่องมือการรวมที่ทรงพลัง."
  },
  "examples": {
    "comment_1": "แทรกแท็กนี้ในเทมเพลตเพื่อทำเครื่องหมายจุดที่รายการจะไป",
    "comment_2": "ตั้งค่าเส้นทางไฟล์สำหรับเทมเพลตของคุณ",
    "comment_3": "ดึงข้อมูลจากแหล่งที่คุณต้องการใช้งาน",
    "comment_4": "บันทึกไฟล์พร้อมด้วยรายการที่แทรก"
  },
  "steps": {
    "title": "ขั้นตอนการแทรกรายการลงในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การเพิ่มรายการที่มีรายละเอียดและขับเคลื่อนด้วยข้อมูลลงในเทมเพลต {{FileFormatUp}} เป็นเรื่องง่าย.",
      "step_1": "สร้างเทมเพลต {{FileFormatUp}} และกำหนดจุดแทนสำหรับรายการ.",
      "step_2": "ระบุเส้นทางไฟล์ของเทมเพลต.",
      "step_3": "โหลดข้อมูลจากแหล่งที่รองรับ เช่น JSON หรือ XML.",
      "step_4": "บันทึกเอกสารพร้อมกับรายการที่สร้างขึ้น."
    }
  },
  "code_1": {
    "title": "สร้างรายการในเอกสารด้วยโปรแกรม",
    "content": "ตัวอย่างนี้แสดงวิธีการเพิ่มรายการแบบไดนามิกไปยังเอกสาร {{FileFormatUp}} โดยใช้ {{ProdShortName}}.",
    "comment_1": "เพิ่มจุดแทนในเทมเพลตสำหรับรายการ",
    "comment_2": "ระบุเส้นทางไฟล์ของเทมเพลต",
    "comment_3": "โหลดข้อมูลเพื่อนำไปเติมรายการ",
    "comment_4": "เตรียมแหล่งข้อมูลด้วยรายละเอียดที่จำเป็น",
    "comment_5": "เริ่มต้น {{DocumentAssembler}}",
    "comment_6": "บันทึกเอกสารสุดท้ายพร้อมด้วยรายการที่รวมอยู่"
  },
  "texts_pdf": {
    "step_1": "ออกแบบเทมเพลตด้วยจุดแทนสำหรับรายการ (เทมเพลต PDF ไม่รองรับ).",
    "step_4": "ส่งออกเอกสารที่เสร็จสมบูรณ์พร้อมรายการเป็นไฟล์ PDF.",
    "comment_tmp": "เทมเพลต PDF ยังคงไม่ถูกสนับสนุน."
  }
}