{
  "head": {
    "title": "Генерация штрих-кодов в документах {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "API {{ProdFullName}} позволяет разработчикам динамически создавать и встраивать изображения штрих-кодов в документы и электронные письма."
  },
  "header": {
    "title": "Добавьте штрих-коды в документы {{FileFormatUp}} с помощью нашего API {{EnvNameShort}}",
    "description": "{{ProdFullName}} полностью поддерживает создание и встраивание штрих-кодов в документы {{FileFormatUp}} динамически.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатную версию"
  },
  "about": {
    "title": "Обзор {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) разработан, чтобы помочь вам генерировать документы и отчеты, интегрируя данные из множества источников. Заполняйте документы текстом или числовыми данными, создавайте диаграммы, таблицы и списки или вставляйте изображения и штрих-коды на лету. Используйте расширенный разметку для точного размещения данных. Поддерживает более 50 форматов, включая PDF, файлы MS Office и электронные письма."
  },
  "more_features": {
    "title": "Генерация документов путем заполнения шаблонов данными",
    "description": "{{ProdFullName}} создан для упрощения создания документов в популярных форматах. Добавляйте диаграммы, списки, таблицы, гиперссылки, изображения и штрих-коды с помощью расширенных шаблонов и разметки.",
    "image_description": "Особенности {{ProdShortName}}",
    "feature_1": {
      "title": "Создание отчетов на основе бизнес-данных",
      "content": "Наш API эффективно заполняет документы в популярных офисных форматах, используя данные из таких источников, как JSON, XML и CSV."
    },
    "feature_2": {
      "title": "Использование визуальных элементов для отображения данных",
      "content": "{{ProdShortName}} поддерживает встраивание нативных элементов, таких как списки, таблицы и диаграммы, наряду с текстом, гиперссылками, изображениями и динамически создаваемыми штрих-кодами."
    },
    "feature_3": {
      "title": "Вставка данных в любом месте документа",
      "content": "Используйте синтаксис на основе LINQ для точного размещения данных в нужных местах. Массивы могут быть вставлены с помощью циклов for-each, а форматирование (например, цвет) можно настраивать программно."
    },
    "feature_4": {
      "title": "Поддерживает широкий спектр форматов",
      "content": "Обрабатывайте популярные форматы файлов, такие как MS Office, OpenOffice, PDF, HTML и различные форматы электронных писем. Вставляйте один документ в другой по мере необходимости."
    }
  },
  "formats": {
    "title": "Создание отчетов в популярных форматах",
    "description": "{{EnvName}} поддерживает генерацию отчетов более чем в 50 форматах, позволяя вам бесшовно объединять данные и шаблоны для выдающихся результатов."
  },
  "operations": {
    "title": "Изучите ключевые возможности",
    "description": "Наше решение разработано для оптимизации обработки бизнес-документов."
  },
  "examples": {
    "comment_1": "Вставьте этот тег в ваш шаблон для генерации штрих-кода в итоговом документе",
    "comment_2": "Укажите путь к файлу шаблона",
    "comment_3": "Получите данные из вашего источника",
    "comment_4": "Сохраните документ с сгенерированным штрих-кодом"
  },
  "steps": {
    "title": "Шаги для добавления сгенерированного штрих-кода в документ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) упрощает вставку штрих-кодов в шаблоны в таких форматах, как {{FileFormatUp}}. Поддерживает более 60 типов штрих-кодов, включая одноразмерные и двумерные форматы.",
      "step_1": "Подготовьте шаблон {{FileFormatUp}} с заполнителями для штрих-кодов.",
      "step_2": "Получите данные из любого поддерживаемого источника данных.",
      "step_3": "Настройте дополнительные параметры, такие как размер или разрешение штрих-кода.",
      "step_4": "Сохраните шаблон с штрих-кодом как новый документ."
    }
  },
  "code_1": {
    "title": "Как динамически генерировать штрих-код",
    "content": "Этот пример демонстрирует встраивание динамически сгенерированного штрих-кода в документ {{FileFormatUp}}.",
    "comment_1": "Используйте этот шаблон для вставки штрих-кода в документ",
    "comment_2": "Укажите путь к файлу шаблона",
    "comment_3": "Получите данные из вашего выбранного источника",
    "comment_4": "Создайте объект источника данных только с необходимыми данными",
    "comment_5": "Инициализируйте {{DocumentAssembler}}",
    "comment_6": "Настройте дополнительные свойства штрих-кода",
    "comment_7": "Сохраните финальный документ с встраиваемым штрих-кодом"
  },
  "texts_pdf": {
    "step_1": "Создайте шаблон с конкретными тегами для размещения штрих-кода (учтите: PDF-шаблоны несовместимы).",
    "step_4": "Сохраните финальный документ с вставленным штрих-кодом в формате PDF.",
    "comment_tmp": "Поддержка PDF-шаблонов в настоящее время недоступна."
  }
}