{
  "head": {
    "title": "Генеруйте штрих-коди в документах {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "API {{ProdFullName}} дозволяє розробникам динамічно генерувати та вбудовувати зображення штрих-кодів у документи та електронні листи."
  },
  "header": {
    "title": "Додайте штрих-коди до документів {{FileFormatUp}} за допомогою нашого API {{EnvNameShort}}",
    "description": "{{ProdFullName}} надає повну підтримку для динамічного створення та вбудовування штрих-кодів у документи {{FileFormatUp}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачати безкоштовну версію"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) створено для допомоги у генерації документів та звітів шляхом інтеграції даних з різних джерел. Наповнюйте документи текстом або числовими даними, створюйте графіки, таблиці, списки або вставляйте зображення та штрих-коди на льот. Використовуйте розширений розмітку для точного розміщення даних. Підтримує більш ніж 50 форматів, включаючи PDF, файли MS Office та електронні листи."
  },
  "more_features": {
    "title": "Генерація документів шляхом заповнення шаблонів даними",
    "description": "{{ProdFullName}} розроблений для спрощення створення документів у популярних форматах. Додавайте графіки, списки, таблиці, гіперпосилання, зображення та штрих-коди, використовуючи розширені шаблони та розмітку.",
    "image_description": "Особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Створення звітів з бізнес-даних",
      "content": "Наш API ефективно заповнює документи в популярних офісних форматах, використовуючи дані з таких джерел, як JSON, XML та CSV."
    },
    "feature_2": {
      "title": "Використовуйте візуальні елементи для відображення даних",
      "content": "{{ProdShortName}} підтримує вбудовування нативних елементів, таких як списки, таблиці та графіки, а також текст, гіперпосилання, зображення та динамічно генеровані штрих-коди."
    },
    "feature_3": {
      "title": "Вставляйте дані будь-де в документі",
      "content": "Використовуйте синтаксис на базі LINQ для точного розташування даних. Масиви можна вставляти за допомогою циклів для-each, а форматування (наприклад, колір) можна налаштувати програмно."
    },
    "feature_4": {
      "title": "Підтримує широкий спектр форматів",
      "content": "Обробляйте популярні формати файлів, такі як MS Office, OpenOffice, PDF, HTML та різні формати електронної пошти. Вбудовуйте один документ в інший за потреби."
    }
  },
  "formats": {
    "title": "Створення звітів в популярних форматах",
    "description": "{{EnvName}} підтримує генерацію звітів у більш ніж 50 форматах, що дозволяє безперешкодно об'єднувати дані та шаблони для видатних результатів."
  },
  "operations": {
    "title": "Ознайомтесь з ключовими функціями",
    "description": "Наше рішення розроблене для оптимізації ваших потреб у обробці бізнес-документів."
  },
  "examples": {
    "comment_1": "Вставте цей тег у свій шаблон для генерації штрих-коду в фінальному документі",
    "comment_2": "Вкажіть шлях до файлу шаблону",
    "comment_3": "Отримайте дані з вашого джерела",
    "comment_4": "Збережіть документ з згенерованим штрих-кодом"
  },
  "steps": {
    "title": "Кроки для додавання згенерованого штрих-коду до документа {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє вставляти штрих-коди в шаблони у форматах, таких як {{FileFormatUp}}. Підтримує понад 60 типів штрих-кодів, включаючи одновимірні та двовимірні формати.",
      "step_1": "Підготуйте шаблон {{FileFormatUp}} з місцями для штрих-кодів.",
      "step_2": "Отримайте дані з будь-якого підтримуваного джерела даних.",
      "step_3": "Налаштуйте додаткові параметри, такі як розмір або роздільна здатність штрих-коду.",
      "step_4": "Збережіть шаблон зі штрих-кодом як новий документ."
    }
  },
  "code_1": {
    "title": "Як динамічно генерувати штрих-код",
    "content": "Цей приклад демонструє вбудовування динамічно згенерованого штрих-коду в документ {{FileFormatUp}}.",
    "comment_1": "Використовуйте цей шаблон для вставки штрих-коду в документ",
    "comment_2": "Вкажіть шлях до файлу шаблону",
    "comment_3": "Отримайте дані з вибраного джерела",
    "comment_4": "Створіть об'єкт джерела даних лише з потрібними даними",
    "comment_5": "Ініціалізуйте {{DocumentAssembler}}",
    "comment_6": "Встановіть додаткові властивості штрих-коду",
    "comment_7": "Збережіть фінальний документ з вбудованим штрих-кодом"
  },
  "texts_pdf": {
    "step_1": "Створіть шаблон зі специфічними тегами для розміщення штрих-коду (зауважте: шаблони PDF не сумісні).",
    "step_4": "Збережіть фінальний документ з вставленим штрих-кодом у форматі PDF.",
    "comment_tmp": "Підтримка PDF шаблонів наразі недоступна."
  }
}