{
  "head": {
    "title": "Generate barcodes in {{FileFormatUp}} Documents via {{ProgLang}}",
    "description": "{{ProdFullName}} API allows developers to dynamically generate & insert Barcode images to documents & Email messages with ease."
  },
  "header": {
    "title": "Insert generated Barcodes in {{FileFormatUp}} Documents with our .NET API ",
    "description": "{{ProdFullName}} provides complete support for dynamic Barcode image creation, editing and addition inside {{FileFormatUp}} documents using {{ProgLang}} API.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for free"
  },
  "about": {
    "title": "{{ProdFullName}} overview",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is designed in order to generate documents and reports by adding various data from wide range of data sources. Populate with textual or numeric data objects like charts, tables, lists. Insert images or barcodes generated on the fly. Use sophisticated mark-up to insert data in the right place of a document. Over 50 document formats like PDF, MS Office, emails, etc. are supported."
  },
  "more_features": {
    "title": "Generate documents populating templates with data",
    "description": "The {{ProdFullName}} solution is engineered to provide service of documents generating across widely used formats. Add charts, lists, tables, hyper-links, images, barcodes using special markup and templates.",
    "image_description": "{{ProdShortName}} Features",
    "feature_1": {
      "title": "Construct reports based on business data",
      "content": "Our API provides efficient algorithms to populate document of popular office formats with data from well-known data source formats like JSON, XML, CSV, etc."
    },
    "feature_2": {
      "title": "Use visual object to represent your data",
      "content": "{{ProdShortName}} supports many native data objects such as lists, tables, charts in business documents. Text, hyper-links, images or on the spot generated barcodes are available."
    },
    "feature_3": {
      "title": "Place data in any part of a document",
      "content": "Use LINQ-based template syntax to insert data in a proper place. Data arrays may be placed with for-each syntax. It is possible to set up format (color, etc.) of data elements programmatically."
    },
    "feature_4": {
      "title": "Wide range of supported formats",
      "content": "We provide access to processing many popular formats like MS Office, Open Office, PDF, Html, various email formats. Some documents may be inserted into other ones."
    }
  },
  "formats": {
    "title": "Generate reports of popular formats",
    "description": "{{EnvName}} supports reporting in more than 50 different formats. Effortlessly merge data and documents to have an excellent result."
  },
  "operations": {
    "title": "Inspect our main features",
    "description": "We developed capable solution in order to help you with business documents"
  },
  "examples": {
    "comment_1": "Use such template to insert a barcode to a document",
    "comment_2": "Specify the template path",
    "comment_3": "Get data from the source",
    "comment_4": "Save result document with generated barcode"
  },
  "steps": {
    "title": "How to add generated barcode to {{FileFormatUp}} document",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) allows to insert barcodes to many templates in popular formats like {{FileFormatUp}}. More than 60 barcode types are supported. One and two-dimensional barcodes are ready for processing.",
      "step_1": "Provide {{FileFormatUp}} template with barcode markup.",
      "step_2": "Get data from the any supported data source.",
      "step_3": "Set up some additional properties like barcode dimensions or resolution.",
      "step_4": "Save the template with barcode as a new document."
    }
  },
  "code_1": {
    "title": "How to generate a barcode on the fly",
    "content": "This example demonstrates how to embed a generated barcode to {{FileFormatUp}} document.",
    "comment_1": "Use such template to insert a barcode to a document",
    "comment_2": "Specify the template path",
    "comment_3": "Get data from the specific source",
    "comment_4": "Create data source object with only demanded data",
    "comment_5": "Instantiate {{DocumentAssembler}}",
    "comment_6": "Set up additional barcode properties",
    "comment_7": "Save result document with barcode"
  }
}