{
  "head": {
    "title": "สร้างบาร์โค้ดในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "API ของ {{ProdFullName}} ช่วยให้นักพัฒนาสามารถสร้างและฝังภาพบาร์โค้ดลงในเอกสารและอีเมลได้อย่างพลิกแพลง"
  },
  "header": {
    "title": "เพิ่มบาร์โค้ดในเอกสาร {{FileFormatUp}} โดยใช้ API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} รองรับการสร้างและฝังบาร์โค้ดในเอกสาร {{FileFormatUp}} ได้อย่างเต็มที่",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดรุ่นทดลองใช้ฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ถูกสร้างขึ้นเพื่อช่วยให้คุณสร้างเอกสารและรายงานโดยการรวมข้อมูลจากแหล่งข้อมูลที่หลากหลาย สร้างเอกสารด้วยข้อความหรือข้อมูลเชิงตัวเลข สร้างแผนภูมิ ตาราง และรายการ หรือแทรกรูปภาพและบาร์โค้ดแบบเรียลไทม์ ใช้การทำเครื่องหมายขั้นสูงเพื่อตำแหน่งข้อมูลอย่างแม่นยำ รองรับรูปแบบมากกว่า 50 รูปแบบ รวมถึง PDF, ไฟล์ MS Office และอีเมล"
  },
  "more_features": {
    "title": "สร้างเอกสารโดยกรอกข้อมูลในเท็มเพลต",
    "description": "{{ProdFullName}} ถูกออกแบบมาเพื่อลดความซับซ้อนในการสร้างเอกสารในรูปแบบที่นิยม ใช้เท็มเพลตขั้นสูงและการทำเครื่องหมายเพื่อตั้งค่าแผนภูมิ รายการ ตาราง ลิงก์ รูปภาพ และบาร์โค้ด",
    "image_description": "คุณสมบัติของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากข้อมูลธุรกิจ",
      "content": "API ของเราช่วยให้การกรอกข้อมูลในเอกสารรูปแบบที่นิยมเป็นไปอย่างมีประสิทธิภาพโดยใช้ข้อมูลจากแหล่งที่มาที่เป็นเช่น JSON, XML และ CSV"
    },
    "feature_2": {
      "title": "ใช้เอฟเฟกต์กราฟิกเพื่อแสดงข้อมูล",
      "content": "{{ProdShortName}} รองรับการฝังองค์ประกอบพื้นเมือง เช่น รายการ ตาราง และแผนภูมิ รวมทั้งข้อความ ลิงก์ รูปภาพ และบาร์โค้ดที่สร้างขึ้นแบบพลริส"
    },
    "feature_3": {
      "title": "แทรกข้อมูลได้ทุกที่ในเอกสาร",
      "content": "ใช้ไวยากรณ์แบบ LINQ เพื่อวางข้อมูลอย่างแม่นยำตามที่ต้องการ อาเรย์สามารถแทรกได้โดยใช้ลูป for-each และการจัดรูปแบบ (เช่น สี) สามารถปรับเปลี่ยนได้ตามโปรแกรม"
    },
    "feature_4": {
      "title": "รองรับรูปแบบที่หลากหลาย",
      "content": "จัดการกับรูปแบบไฟล์ที่เป็นที่นิยม เช่น MS Office, OpenOffice, PDF, HTML และรูปแบบอีเมลต่างๆ คุณสามารถแทรกเอกสารหนึ่งในอีกเอกสารหนึ่งได้ตามต้องการ"
    }
  },
  "formats": {
    "title": "สร้างรายงานในรูปแบบที่นิยม",
    "description": "{{EnvName}} รองรับการสร้างรายงานในมากกว่า 50 รูปแบบ ทำให้คุณสามารถรวมข้อมูลและเท็มเพลตได้อย่างลงตัวเพื่อผลลัพธ์ที่ยอดเยี่ยม"
  },
  "operations": {
    "title": "สำรวจคุณสมบัติหลัก",
    "description": "โซลูชันของเราถูกออกแบบมาเพื่อปรับปรุงกระบวนการเอกสารธุรกิจของคุณ"
  },
  "examples": {
    "comment_1": "แทรกแท็กนี้ลงในเท็มเพลตเพื่อสร้างบาร์โค้ดในเอกสารสุดท้าย",
    "comment_2": "ระบุเส้นทางไฟล์เท็มเพลต",
    "comment_3": "เรียกข้อมูลจากแหล่งที่มาของคุณ",
    "comment_4": "บันทึกเอกสารพร้อมกับบาร์โค้ดที่สร้างขึ้น"
  },
  "steps": {
    "title": "ขั้นตอนการเพิ่มบาร์โค้ดที่สร้างขึ้นในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้ง่ายต่อการแทรกบาร์โค้ดในเท็มเพลตในรูปแบบ {{FileFormatUp}} รองรับบาร์โค้ดมากกว่า 60 ประเภท รวมถึงรูปแบบเชิงหนึ่งและสองมิติ",
      "step_1": "เตรียมเท็มเพลต {{FileFormatUp}} พร้อมแท็กสำหรับบาร์โค้ด",
      "step_2": "เรียกข้อมูลจากแหล่งข้อมูลที่รองรับใดๆ",
      "step_3": "กำหนดคุณสมบัติเสริมเช่น ขนาดหรือความละเอียดของบาร์โค้ด",
      "step_4": "บันทึกเท็มเพลตพร้อมบาร์โค้ดเป็นเอกสารใหม่"
    }
  },
  "code_1": {
    "title": "วิธีการสร้างบาร์โค้ดแบบพลิกแพลง",
    "content": "ตัวอย่างนี้แสดงถึงการฝังบาร์โค้ดที่สร้างขึ้นแบบพลิกแพลงลงในเอกสาร {{FileFormatUp}}",
    "comment_1": "ใช้เท็มเพลตนี้เพื่อแทรกบาร์โค้ดในเอกสาร",
    "comment_2": "ระบุเส้นทางไปยังไฟล์เท็มเพลต",
    "comment_3": "เรียกข้อมูลจากแหล่งที่คุณเลือก",
    "comment_4": "สร้างวัตถุแหล่งข้อมูลที่มีเฉพาะข้อมูลที่จำเป็นเท่านั้น",
    "comment_5": "เริ่มต้น {{DocumentAssembler}}",
    "comment_6": "ตั้งค่าคุณสมบัติเพิ่มเติมของบาร์โค้ด",
    "comment_7": "บันทึกเอกสารสุดท้ายที่มีบาร์โค้ดฝังอยู่"
  },
  "texts_pdf": {
    "step_1": "สร้างเท็มเพลตที่มีแท็กเฉพาะสำหรับการวางบาร์โค้ด (หมายเหตุ: เท็มเพลต PDF ไม่สามารถใช้งานได้)",
    "step_4": "บันทึกเอกสารสุดท้ายพร้อมบาร์โค้ดที่แทรกเป็น PDF",
    "comment_tmp": "การสนับสนุนสำหรับเท็มเพลต PDF ไม่สามารถใช้งานได้ในขณะนี้"
  }
}