{
  "head": {
    "title": "ฝังบาร์โค้ดในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "API {{ProdFullName}} ทำให้การสร้างและแทรกภาพบาร์โค้ดในเอกสารและอีเมลของคุณเป็นเรื่องง่ายในเวลาจริง."
  },
  "header": {
    "title": "สร้างบาร์โค้ดสำหรับไฟล์ {{FileFormatUp}} ด้วย API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} ให้เครื่องมือที่ครอบคลุมในการสร้าง ปรับแต่ง และฝังบาร์โค้ดในไฟล์ {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทันที"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ช่วยให้คุณสร้างและปรับแต่งเอกสารโดยการเพิ่มข้อมูลจากหลายแหล่ง. แทรกข้อความ ตัวเลข แผนภูมิ ตาราง รายการ รูปภาพ และบาร์โค้ด. ใช้เทมเพลตขั้นสูงเพื่อให้ข้อมูลแสดงผลตามที่คุณต้องการ. รองรับรูปแบบมากกว่า 50 รูปแบบ รวมถึง PDF, เอกสาร Office และอีเมล."
  },
  "more_features": {
    "title": "สร้างเอกสารโดยใช้เทมเพลตที่ขับเคลื่อนด้วยข้อมูล",
    "description": "{{ProdFullName}} ทำให้การสร้างเอกสารง่ายขึ้นในไฟล์ประเภทยอดนิยม. ใช้เทมเพลตเพื่อเพิ่มแผนภูมิ ตาราง รายการ ลิงก์ รูปภาพ และบาร์โค้ดได้อย่างราบรื่น.",
    "image_description": "ฟีเจอร์ของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานโดยใช้ข้อมูลธุรกิจ",
      "content": "API จะเติมเอกสารด้วยข้อมูลจากรูปแบบต่างๆ เช่น JSON, XML และ CSV อย่างมีประสิทธิภาพและแม่นยำ."
    },
    "feature_2": {
      "title": "แสดงข้อมูลด้วยองค์ประกอบในตัว",
      "content": "{{ProdShortName}} รองรับองค์ประกอบพื้นฐาน เช่น ตาราง แผนภูมิ และรายการ รวมถึงข้อความ ลิงก์ รูปภาพ และการสร้างบาร์โค้ดในเวลาจริง."
    },
    "feature_3": {
      "title": "แทรกข้อมูลในที่ที่คุณต้องการ",
      "content": "ด้วยเทมเพลตที่ใช้ LINQ คุณสามารถวางข้อมูลได้อย่างแม่นยำ ใช้ลูปเพื่อเพิ่มอาร์เรย์ และปรับแต่งรูปแบบเช่นสีได้ทางโปรแกรม."
    },
    "feature_4": {
      "title": "รองรับความเข้ากันได้กว้างกับประเภทไฟล์",
      "content": "จัดการไฟล์ต่างๆ เช่น เอกสาร MS Office, PDF, HTML, OpenOffice และอีเมล. คุณยังสามารถรวมเอกสารหนึ่งเข้าไปในอีกเอกสารหนึ่งได้."
    }
  },
  "formats": {
    "title": "สร้างรายงานในรูปแบบต่างๆ",
    "description": "{{EnvName}} รองรับไฟล์มากกว่า 50 ประเภท, ช่วยให้การรวมข้อมูลและการประมวลผลเทมเพลตเป็นเรื่องง่ายสำหรับผลลัพธ์ที่เป็นมืออาชีพ."
  },
  "operations": {
    "title": "ค้นพบฟีเจอร์หลัก",
    "description": "แพลตฟอร์มของเราทำให้การจัดการเอกสารธุรกิจง่ายขึ้นด้วยเครื่องมือและการทำงานอัตโนมัติที่มีพลัง."
  },
  "examples": {
    "comment_1": "ใช้แท็กนี้ในเทมเพลตของคุณเพื่อสร้างบาร์โค้ดในเอกสารที่ส่งออก",
    "comment_2": "ตั้งค่าเส้นทางไฟล์สำหรับเทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งข้อมูลของคุณ",
    "comment_4": "บันทึกเอกสารที่ปรับปรุงพร้อมบาร์โค้ด"
  },
  "steps": {
    "title": "วิธีฝังบาร์โค้ดในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณแทรกบาร์โค้ดในรูปแบบที่ได้รับความนิยม เช่น เทมเพลต {{FileFormatUp}} รองรับประเภทบาร์โค้ดมากกว่า 60 ประเภท รวมถึงบาร์โค้ด 1D และ 2D.",
      "step_1": "ตั้งค่าเทมเพลต {{FileFormatUp}} พร้อมเครื่องหมายบาร์โค้ด.",
      "step_2": "ดึงข้อมูลจากแหล่งข้อมูลที่รองรับ.",
      "step_3": "ปรับแต่งการตั้งค่าบาร์โค้ด เช่น ขนาดและความละเอียด.",
      "step_4": "บันทึกเอกสารพร้อมบาร์โค้ดที่ฝังอยู่."
    }
  },
  "code_1": {
    "title": "วิธีสร้างบาร์โค้ดแบบไดนามิก",
    "content": "ในตัวอย่างนี้จะแสดงวิธีการสร้างและเพิ่มบาร์โค้ดไปยังเอกสาร {{FileFormatUp}} แบบไดนามิก.",
    "comment_1": "เตรียมเทมเพลตที่มีช่องว่างสำหรับบาร์โค้ด",
    "comment_2": "ตั้งค่าเส้นทางไปยังไฟล์เทมเพลตของคุณ",
    "comment_3": "โหลดข้อมูลจากแหล่งข้อมูลเฉพาะ",
    "comment_4": "สร้างวัตถุแหล่งข้อมูลด้วยข้อมูลที่จำเป็น",
    "comment_5": "สร้างอินสแตนซ์ของ {{DocumentAssembler}}",
    "comment_6": "ปรับแต่งการตั้งค่าบาร์โค้ด",
    "comment_7": "บันทึกเอกสารที่ปรับปรุงพร้อมบาร์โค้ด"
  },
  "texts_pdf": {
    "step_1": "เตรียมเทมเพลตที่มีตัวplaceholder สำหรับบาร์โค้ด (ไฟล์เทมเพลต PDF ไม่รองรับ).",
    "step_4": "บันทึกเอกสารพร้อมบาร์โค้ดที่เพิ่มเข้ามาเป็นไฟล์ PDF.",
    "comment_tmp": "เทมเพลต PDF ไม่รองรับในขณะนี้."
  }
}