{
  "head": {
    "title": "Create tables in {{FileFormatUp}} documents with {{ProgLang}}",
    "description": "The {{ProdFullName}} API allows developers to effortlessly add and populate tables in documents and emails with data from dynamic sources."
  },
  "header": {
    "title": "Generate data tables in {{FileFormatUp}} documents using our {{EnvNameShort}} API",
    "description": "{{ProdFullName}} makes it easy to dynamically fill tables in {{FileFormatUp}} documents with data from various sources.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "{{ProdFullName}} Overview",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is built to create documents and reports by filling templates with data from multiple sources. Effortlessly insert structured data into tables, lists, and charts, or embed images dynamically. Advanced syntax ensures accurate data placement. Supports over 50 formats, including PDFs, MS Office documents, and email files."
  },
  "more_features": {
    "title": "Generate documents with dynamic tables",
    "description": "{{ProdFullName}} streamlines document creation by automating table population and supporting additional elements like charts, lists, and images through templates and advanced markup.",
    "image_description": "Key Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Create reports from structured data",
      "content": "The API processes data from sources such as JSON, XML, and CSV to populate tables in office documents efficiently and accurately."
    },
    "feature_2": {
      "title": "Display data visually",
      "content": "{{ProdShortName}} enables the creation of tables, lists, and charts, along with embedding text, links, and images for professional document design."
    },
    "feature_3": {
      "title": "Precisely position table data",
      "content": "Use LINQ-based syntax to dynamically add table rows and columns. Customize styles, including colors and formatting, programmatically."
    },
    "feature_4": {
      "title": "Supports a wide range of formats",
      "content": "Easily handle popular file formats like MS Office, OpenOffice, PDF, and HTML. Seamlessly insert populated tables into supported document types."
    }
  },
  "formats": {
    "title": "Create reports with detailed tables",
    "description": "{{EnvName}} enables the creation of comprehensive reports by filling templates with tables and other data elements in over 50 supported formats."
  },
  "operations": {
    "title": "Explore key features",
    "description": "Our solution simplifies the creation of professional documents with dynamically populated tables and additional elements."
  },
  "examples": {
    "comment_1": "Add these tags into a template table row",
    "comment_2": "Set the file path for the template",
    "comment_3": "Fetch data from a supported source",
    "comment_4": "Save the document with the table filled with data"
  },
  "steps": {
    "title": "How to populate a table in a {{FileFormatUp}} document",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) lets you dynamically populate tables in templates for formats like {{FileFormatUp}}. Insert data from various sources into your tables.",
      "step_1": "Create a {{FileFormatUp}} template with table placeholders.",
      "step_2": "Fetch data from any supported source.",
      "step_3": "Filter the data to include only the required information.",
      "step_4": "Save the document with the populated table."
    }
  },
  "code_1": {
    "title": "How to dynamically populate a data table",
    "content": "This example demonstrates how to fill a table in a {{FileFormatUp}} document using dynamic data.",
    "comment_1": "Prepare a template with a placeholder for the table",
    "comment_2": "Specify the file path to the template",
    "comment_3": "Retrieve data from your chosen source",
    "comment_4": "Create a data source object with the necessary data",
    "comment_5": "Initialize {{DocumentAssembler}}",
    "comment_6": "Save the completed document with the populated table"
  }
}