{
  "head": {
    "title": "เพิ่มตารางในเอกสาร {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ด้วย {{ProdFullName}} นักพัฒนาสามารถรวมตารางเข้ากับเอกสารและอีเมลได้อย่างรวดเร็ว โดยดึงข้อมูลจากแหล่งข้อมูลแบบไดนามิก"
  },
  "header": {
    "title": "เติมตารางในไฟล์ {{FileFormatUp}} ด้วย API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} ช่วยให้กระบวนการเติมตารางในเอกสาร {{FileFormatUp}} ด้วยข้อมูลจากแหล่งข้อมูลต่างๆ เป็นเรื่องง่าย",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ขอทดลองใช้งานฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือสำหรับสร้างเอกสารและรายงานโดยการแทรกข้อมูลลงในแม่แบบที่ออกแบบไว้ล่วงหน้าโดยอัตโนมัติ คุณสามารถเพิ่มตาราง รายการ แผนภูมิ และรูปภาพได้อย่างง่ายดาย คุณลักษณะที่ทันสมัยช่วยให้คุณวางเนื้อหาในเอกสารของคุณได้อย่างแม่นยำ รองรับไฟล์มากกว่า 50 ประเภท รวมถึง PDF, MS Office และรูปแบบอีเมล"
  },
  "more_features": {
    "title": "สร้างเอกสารที่มีตารางที่เต็มไปด้วยข้อมูล",
    "description": "{{ProdFullName}} ทำให้การสร้างตารางในเอกสารของคุณเป็นเรื่องง่าย นอกจากนี้ยังสนับสนุนการเพิ่มองค์ประกอบเช่น แผนภูมิ รายการ และรูปภาพ โดยใช้แม่แบบ",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากหลายรูปแบบข้อมูล",
      "content": "API ทำงานร่วมกับ JSON, XML, CSV และรูปแบบอื่นๆ ได้อย่างราบรื่นเพื่อตอบสนองความต้องการในการกรอกตารางในเอกสารของคุณด้วยข้อมูลที่จัดระเบียบ"
    },
    "feature_2": {
      "title": "นำเสนอข้อมูลอย่างมีภาพลักษณ์",
      "content": "{{ProdShortName}} ช่วยให้คุณสร้างตาราง รายการ และแผนภูมิที่ดูเป็นมืออาชีพ รวมทั้งแทรกลิงก์ ข้อความ และรูปภาพ เพื่อให้มีรูปลักษณ์ที่เหมาะสม"
    },
    "feature_3": {
      "title": "วางเนื้อหาตารางอย่างแม่นยำ",
      "content": "ใช้ไวยากรณ์ที่ยืดหยุ่นตาม LINQ เพื่อเพิ่มแถวและคอลัมน์แบบไดนามิก ปรับแต่งลักษณะเช่น สไตล์ฟอนต์และสี ได้อย่างเป็นโปรแกรม"
    },
    "feature_4": {
      "title": "เข้ากันได้กับหลายรูปแบบ",
      "content": "ทำงานกับ MS Office, OpenOffice, PDF, HTML และอื่นๆ รวมตารางเข้ากับรูปแบบไฟล์ที่รองรับได้โดยไม่ยุ่งยาก"
    }
  },
  "formats": {
    "title": "สร้างตารางที่มีรายละเอียดในรูปแบบต่างๆ",
    "description": "ด้วย {{EnvName}} คุณสามารถกรอกข้อมูลในแม่แบบและสร้างรายงานที่มีรายละเอียดในมากกว่า 50 ประเภทไฟล์"
  },
  "operations": {
    "title": "ฟีเจอร์หลักในภาพรวม",
    "description": "API ของเราช่วยให้การสร้างเอกสารที่มีคุณภาพเป็นเรื่องง่ายโดยการอัตโนมัติการกรอกตารางพร้อมองค์ประกอบที่มีประสิทธิภาพอื่นๆ"
  },
  "examples": {
    "comment_1": "ใช้แท็กเหล่านี้ในที่เก็บแท็บในแถวของตารางภายในแม่แบบของคุณ",
    "comment_2": "กำหนดเส้นทางไปยังไฟล์แม่แบบ",
    "comment_3": "โหลดข้อมูลจากแหล่งที่คุณเลือก",
    "comment_4": "บันทึกไฟล์ผลลัพธ์ที่มีการกรอกตาราง"
  },
  "steps": {
    "title": "ขั้นตอนในการแทรกข้อมูลลงในตาราง {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณกรอกแม่แบบตารางสำหรับ {{FileFormatUp}} และรูปแบบอื่น ๆ ใช้ข้อมูลไดนามิกจากแหล่งของคุณเพื่อสร้างตารางอย่างมีประสิทธิภาพ",
      "step_1": "ตั้งค่าแม่แบบ {{FileFormatUp}} พร้อมที่ว่างสำหรับแถวและคอลัมน์ของตาราง",
      "step_2": "ดึงข้อมูลจากแหล่งข้อมูลที่รองรับ",
      "step_3": "กรองหรือแปรรูปข้อมูลให้ตรงตามความต้องการของคุณ",
      "step_4": "สร้างเอกสารสุดท้ายพร้อมตารางที่เสร็จสมบูรณ์"
    }
  },
  "code_1": {
    "title": "สร้างตารางที่มีข้อมูลโดยใช้วิธีการไดนามิก",
    "content": "ตัวอย่างนี้แสดงวิธีการกรอกข้อมูลในตารางในเอกสาร {{FileFormatUp}} โดยใช้ข้อมูลป้อนเข้าที่เป็นไดนามิก",
    "comment_1": "ออกแบบแม่แบบที่มีที่ว่างสำหรับตาราง",
    "comment_2": "ตั้งค่าที่ตั้งไฟล์แม่แบบ",
    "comment_3": "โหลดข้อมูลจากแหล่งที่คุณต้องการ",
    "comment_4": "เตรียมอ็อบเจ็กต์ข้อมูลที่มีฟิลด์ที่จำเป็น",
    "comment_5": "สร้างอินสแตนซ์ของ {{DocumentAssembler}}",
    "comment_6": "บันทึกเอกสารที่มีการกรอกตาราง"
  },
  "texts_pdf": {
    "step_1": "ออกแบบแม่แบบที่มีที่ว่างสำหรับตาราง (แม่แบบ PDF ยังไม่รองรับในขณะนี้)",
    "step_4": "บันทึกเอกสารที่มีการกรอกตารางเป็นไฟล์ PDF",
    "comment_tmp": "แม่แบบ PDF ยังไม่รองรับในขณะนี้"
  }
}