{
  "head": {
    "title": "Insira Tabelas em Documentos {{FileFormatUp}} com {{ProgLang}}",
    "description": "Use o {{ProdFullName}} para inserir rapidamente tabelas em documentos ou e-mails, extraindo dados de várias fontes."
  },
  "header": {
    "title": "Adicione Tabelas a Arquivos {{FileFormatUp}} com {{EnvNameShort}}",
    "description": "Com o {{ProdFullName}}, preencher tabelas em documentos {{FileFormatUp}} é direto, utilizando dados de múltiplas fontes.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Inicie Seu Teste Gratuito"
  },
  "about": {
    "title": "Introdução ao {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) é uma ferramenta poderosa para automação da criação de documentos. Permite inserir tabelas, gráficos, listas e imagens em modelos, com placement de conteúdo preciso. Suporta mais de 50 formatos de arquivo, incluindo PDF, Word e e-mail, tornando mais ágil a geração de relatórios e outras tarefas."
  },
  "more_features": {
    "title": "Adicione Tabelas Baseadas em Dados a Documentos",
    "description": "O {{ProdFullName}} permite aos usuários criar tabelas automaticamente, além de embutir gráficos, imagens e listas utilizando fluxos de trabalho baseados em modelos.",
    "image_description": "Principais Recursos do {{ProdShortName}}",
    "feature_1": {
      "title": "Gere Tabelas a Partir de Dados Estruturados",
      "content": "Recupere dados de JSON, XML, CSV e outros formatos para preencher tabelas de documentos automaticamente."
    },
    "feature_2": {
      "title": "Crie Conteúdo Visual Polido",
      "content": "Use o {{ProdShortName}} para projetar tabelas, gráficos e listas profissionais, além de adicionar links, imagens e texto para um visual refinado do documento."
    },
    "feature_3": {
      "title": "Colocação Dinâmica de Conteúdo em Tabelas",
      "content": "Adicione linhas e colunas programaticamente usando modelos baseados em LINQ, e personalize estilos como fontes, cores e alinhamentos."
    },
    "feature_4": {
      "title": "Funciona Sem Interrupções em Vários Formatos",
      "content": "Crie ou edite facilmente tabelas em MS Office, OpenOffice, PDF, HTML e outros formatos, integrando-as em arquivos conforme necessário."
    }
  },
  "formats": {
    "title": "Gere Tabelas em Diversos Formatos",
    "description": "Com {{EnvName}}, preencha modelos e crie tabelas abrangentes em mais de 50 tipos de arquivos suportados."
  },
  "operations": {
    "title": "Recursos Principais em um Relance",
    "description": "Nossa API automatiza a criação de tabelas e aprimora a geração de documentos com ferramentas e modelos versáteis."
  },
  "examples": {
    "comment_1": "Inclua estas tags nos espaços reservados de linhas da tabela do seu modelo",
    "comment_2": "Especifique o caminho do arquivo do modelo",
    "comment_3": "Carregue seus dados a partir de uma fonte escolhida",
    "comment_4": "Salve o documento final com a tabela preenchida"
  },
  "steps": {
    "title": "Como Adicionar Dados a uma Tabela em {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) permite que você preencha rapidamente modelos de tabela para arquivos {{FileFormatUp}} usando fontes de dados dinâmicas.",
      "step_1": "Crie um modelo {{FileFormatUp}} com espaços reservados para linhas e colunas da tabela.",
      "step_2": "Carregue dados de uma fonte suportada como JSON ou CSV.",
      "step_3": "Organize e formate os dados conforme necessário.",
      "step_4": "Gere o documento com a tabela preenchida."
    }
  },
  "code_1": {
    "title": "Como Preencher Programaticamente uma Tabela",
    "content": "Este exemplo demonstra como preencher uma tabela em um documento {{FileFormatUp}} com dados de uma fonte externa.",
    "comment_1": "Projete um modelo com espaços reservados para a tabela",
    "comment_2": "Especifique o caminho do arquivo para o modelo",
    "comment_3": "Carregue os dados necessários de sua fonte",
    "comment_4": "Organize os dados na estrutura necessária",
    "comment_5": "Inicialize o {{DocumentAssembler}}",
    "comment_6": "Salve o documento de saída com a tabela preenchida"
  },
  "texts_pdf": {
    "step_1": "Crie um modelo com espaços reservados para a tabela (modelos PDF não são suportados atualmente).",
    "step_4": "Exporte o documento com a tabela preenchida como um arquivo PDF.",
    "comment_tmp": "Modelos PDF não são suportados no momento."
  }
}