{
  "head": {
    "title": "สร้างตารางในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "API {{ProdFullName}} ช่วยให้นักพัฒนาสามารถเพิ่มและเติมตารางในเอกสารและอีเมลด้วยข้อมูลจากแหล่งข้อมูลไดนามิกได้อย่างมีประสิทธิภาพ"
  },
  "header": {
    "title": "สร้างตารางข้อมูลในเอกสาร {{FileFormatUp}} โดยใช้ API {{EnvNameShort}} ของเรา",
    "description": "{{ProdFullName}} ทำให้การเติมตารางในเอกสาร {{FileFormatUp}} ด้วยข้อมูลจากแหล่งที่มาแตกต่างกันเป็นเรื่องง่าย",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดการทดลองใช้ฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ถูกสร้างขึ้นเพื่อสร้างเอกสารและรายงานโดยการเติมเทมเพลตด้วยข้อมูลจากหลายแหล่ง ข้อมูลที่มีโครงสร้างสามารถถูกเพิ่มเข้าไปในตาราง รายการ และกราฟอย่างง่ายดาย หรือแทรกรูปภาพแบบไดนามิกได้ การใช้งานซินแทกซ์ขั้นสูงทำให้การจัดวางข้อมูลนั้นถูกต้อง รองรับกว่า 50 รูปแบบ รวมถึง PDF เอกสาร MS Office และไฟล์อีเมล"
  },
  "more_features": {
    "title": "สร้างเอกสารที่มีตารางไดนามิก",
    "description": "{{ProdFullName}} ช่วยให้การสร้างเอกสารเป็นไปอย่างราบรื่นโดยการทำให้ตารางถูกเติมโดยอัตโนมัติ และสนับสนุนองค์ประกอบอื่น ๆ เช่น กราฟ รายการ และรูปภาพผ่านเทมเพลตและมาร์กอัปขั้นสูง",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานจากข้อมูลที่มีโครงสร้าง",
      "content": "API สามารถประมวลผลข้อมูลจากแหล่งเช่น JSON, XML และ CSV เพื่อเติมตารางในเอกสารสำนักงานได้อย่างมีประสิทธิภาพและแม่นยำ"
    },
    "feature_2": {
      "title": "แสดงข้อมูลด้วยภาพ",
      "content": "{{ProdShortName}} อนุญาตให้สร้างตาราง รายการ และกราฟ รวมถึงการแทรกข้อความ ลิงก์ และรูปภาพเพื่อออกแบบเอกสารที่มีคุณภาพสูง"
    },
    "feature_3": {
      "title": "จัดวางข้อมูลในตารางอย่างแม่นยำ",
      "content": "ใช้ซินแทกซ์ที่อิงตาม LINQ เพื่อเพิ่มแถวและคอลัมน์ในตารางแบบไดนามิก ปรับแต่งสไตล์ รวมถึงสีและรูปแบบได้อย่างมีประสิทธิภาพ"
    },
    "feature_4": {
      "title": "รองรับรูปแบบที่หลากหลาย",
      "content": "จัดการกับรูปแบบไฟล์ที่เป็นที่นิยมเช่น MS Office, OpenOffice, PDF และ HTML ได้อย่างราบรื่น แทรกตารางที่เติมข้อมูลแล้วเข้ากับประเภทเอกสารที่รองรับ"
    }
  },
  "formats": {
    "title": "สร้างรายงานที่มีตารางรายละเอียด",
    "description": "{{EnvName}} สามารถสร้างรายงานที่ครอบคลุมโดยการเติมเทมเพลตด้วยตารางและองค์ประกอบข้อมูลอื่น ๆ ในมากกว่า 50 รูปแบบที่รองรับ"
  },
  "operations": {
    "title": "สำรวจคุณสมบัติหลัก",
    "description": "โซลูชันของเราช่วยให้การสร้างเอกสารมืออาชีพที่มีตารางที่เติมข้อมูลแบบไดนามิกและองค์ประกอบเพิ่มเติมนั้นเป็นเรื่องง่าย"
  },
  "examples": {
    "comment_1": "เพิ่มแท็กเหล่านี้เข้าไปในแถวของเทมเพลตตาราง",
    "comment_2": "ตั้งค่าพาธไฟล์สำหรับเทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งข้อมูลที่รองรับ",
    "comment_4": "บันทึกเอกสารที่มีตารางที่เติมข้อมูลแล้ว"
  },
  "steps": {
    "title": "วิธีการเติมตารางในเอกสาร {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถเติมตารางในเทมเพลตสำหรับรูปแบบเช่น {{FileFormatUp}} ได้อย่างไดนามิก ใส่ข้อมูลจากแหล่งที่มาหลายแห่งลงในตารางของคุณ",
      "step_1": "สร้างเทมเพลต {{FileFormatUp}} พร้อมที่ว่างสำหรับตาราง",
      "step_2": "ดึงข้อมูลจากแหล่งที่รองรับใด ๆ",
      "step_3": "กรองข้อมูลเพื่อรวมเฉพาะข้อมูลที่ต้องการ",
      "step_4": "บันทึกเอกสารที่มีตารางที่เติมข้อมูลแล้ว"
    }
  },
  "code_1": {
    "title": "วิธีการเติมตารางข้อมูลแบบไดนามิก",
    "content": "ตัวอย่างนี้แสดงวิธีการเติมตารางในเอกสาร {{FileFormatUp}} โดยใช้ข้อมูลแบบไดนามิก",
    "comment_1": "เตรียมเทมเพลตพร้อมที่ว่างสำหรับตาราง",
    "comment_2": "ระบุพาธไฟล์ไปยังเทมเพลต",
    "comment_3": "ดึงข้อมูลจากแหล่งข้อมูลที่คุณเลือก",
    "comment_4": "สร้างวัตถุแหล่งข้อมูลด้วยข้อมูลที่จำเป็น",
    "comment_5": "เริ่มต้น {{DocumentAssembler}}",
    "comment_6": "บันทึกเอกสารที่เสร็จสมบูรณ์พร้อมด้วยตารางที่เติมข้อมูลแล้ว"
  },
  "texts_pdf": {
    "step_1": "สร้างเทมเพลตและเพิ่มที่ว่างสำหรับตาราง (เทมเพลต PDF ยังไม่ได้รับการสนับสนุนในขณะนี้)",
    "step_4": "บันทึกเอกสารพร้อมกับตารางที่เสร็จสมบูรณ์ในรูปแบบไฟล์ PDF",
    "comment_tmp": "เทมเพลต PDF ไม่สามารถใช้งานได้ในเวลานี้"
  }
}