{
  "head": {
    "title": "Insert one document into another in {{FileFormatUp}} using {{ProgLang}} API",
    "description": "Merge one {{FileFormatUp}} document into another using {{ProgLang}}. With just a few lines of code, combine files seamlessly using {{ProdShortName}}."
  },
  "header": {
    "title": "Embed one document into another in {{FileFormatUp}} format",
    "description": "Use {{ProdFullName}} to insert documents into other {{FileFormatUp}} documents easily. Our API provides powerful tools to merge documents with precision.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for Free"
  },
  "about": {
    "title": "Overview of {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced solution for document composition and manipulation. It allows you to combine multiple files by inserting one document into another with precise control. Supporting over 50 formats—including PDF, MS Office files, and more—this tool also lets you organize, edit, and customize the merged content to fit your needs."
  },
  "more_features": {
    "title": "Simplify document merging with advanced features",
    "description": "The {{ProdFullName}} library enables smooth integration of documents into one another for a variety of formats. Combine and customize content effortlessly.",
    "image_description": "Key Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Create reports from your business data",
      "content": "Easily fill documents with data from sources like JSON, XML, and CSV, ensuring accurate and efficient processing."
    },
    "feature_2": {
      "title": "Bring your data to life with visual elements",
      "content": "{{ProdShortName}} lets you add tables, charts, and lists, as well as text, hyperlinks, images, and even barcodes generated on the fly."
    },
    "feature_3": {
      "title": "Place data exactly where it's needed",
      "content": "Use LINQ-based templates to control data placement, handle arrays with loops, and programmatically apply custom styles like colors."
    },
    "feature_4": {
      "title": "Works with a variety of file formats",
      "content": "Supports MS Office documents, PDFs, HTML, OpenOffice files, emails, and more. You can also embed one document into another with ease."
    }
  },
  "formats": {
    "title": "Merge documents across multiple formats",
    "description": "{{EnvName}} API allows seamless document merging with support for over 50 file formats. Easily embed files or sections into your documents, regardless of the format."
  },
  "operations": {
    "title": "Explore our core features",
    "description": "Discover the powerful document composition tools that {{ProdShortName}} provides for merging and embedding files."
  },
  "examples": {
    "comment_1": "Place this tag in your template to specify where the document will be inserted",
    "comment_2": "Define the file path for your template",
    "comment_3": "Retrieve the content of the document you want to insert",
    "comment_4": "Save the completed document"
  },
  "steps": {
    "title": "Steps to embed a document into a {{FileFormatUp}} file",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) lets you combine documents by embedding one file into another {{FileFormatUp}} file. Easily merge content with a variety of customization options.",
      "step_1": "Create a {{FileFormatUp}} template with designated placeholders.",
      "step_2": "Specify the file path for the template.",
      "step_3": "Provide the path to the document you want to insert.",
      "step_4": "Save the final document with the inserted content."
    }
  },
  "code_1": {
    "title": "How to embed an image into a document programmatically",
    "content": "This example demonstrates how to insert image into {{FileFormatUp}} document using {{ProdShortName}}.",
    "comment_1": "Add specific tag to template document",
    "comment_2": "Set up the path to the template",
    "comment_3": "Set up the path to the image",
    "comment_4": "Create an instance of {{DocumentAssembler}}",
    "comment_5": "Save the result document with the inserted image"
  }
}
