{
  "head": {
    "title": "แทรกเอกสารหนึ่งลงในอีกเอกสารในรูปแบบ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "รวมไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}} ได้อย่างมีประสิทธิภาพ {{ProdShortName}} ทำให้กระบวนการรวมเอกสารง่ายขึ้นในไม่กี่บรรทัดของโค้ด"
  },
  "header": {
    "title": "ฝังเนื้อหาเข้าสู่ไฟล์ {{FileFormatUp}} อย่างมีประสิทธิภาพ",
    "description": "ใช้ {{ProdFullName}} ในการแทรกเอกสาร {{FileFormatUp}} หนึ่งเข้าไปอีกเอกสารหนึ่งได้อย่างราบรื่น รับผลที่แม่นยำด้วยเครื่องมือที่ยืดหยุ่นและเชื่อถือได้",
    "subtitle": "{{ProdFullName}}",
    "action_title": "รับฟรีตอนนี้"
  },
  "about": {
    "title": "คืออะไร {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันที่หลากหลายสำหรับการจัดการเอกสาร มันช่วยให้คุณสามารถรวมเอกสารหนึ่งเข้าไปในอีกเอกสารหนึ่งได้อย่างง่ายดาย รองรับกว่า 50 รูปแบบ เช่น PDFs และไฟล์ MS Office ปรับแต่งผลลัพธ์ของคุณโดยการรวม แก้ไข และจัดระเบียบเนื้อหาให้ตรงตามต้องการ"
  },
  "more_features": {
    "title": "เครื่องมือที่ก้าวหน้าสำหรับการรวมเอกสาร",
    "description": "ด้วย {{ProdFullName}} การฝังเอกสารเป็นเรื่องที่ตรงไปตรงมาและปรับแต่งได้ ไม่ว่าไฟล์ประเภทใดก็ตาม ทำให้คุณได้ผลลัพธ์ที่เรียบร้อยและสม่ำเสมอในโครงการของคุณ",
    "image_description": "จุดเด่นของ {{ProdShortName}}",
    "feature_1": {
      "title": "สร้างรายงานโดยใช้ข้อมูลธุรกิจ",
      "content": "กรอกเอกสารด้วยข้อมูลจากแหล่งต่างๆ เช่น JSON, XML หรือ CSV ได้อย่างรวดเร็วและเชื่อถือได้ ช่วยให้กระบวนการทำงานของคุณราบรื่น"
    },
    "feature_2": {
      "title": "เพิ่มเนื้อหาภาพลงในเอกสาร",
      "content": "{{ProdShortName}} ช่วยให้คุณสามารถแทรกตาราง แผนภูมิ และรายการควบคู่ไปกับข้อความ ลิงก์ ไฮเปอร์ลิงก์ รูปภาพ และแม้กระทั่งบาร์โค้ดที่มีพลศาสตร์"
    },
    "feature_3": {
      "title": "จัดวางข้อมูลอย่างแม่นยำ",
      "content": "เทมเพลต LINQ ช่วยให้จัดตำแหน่งข้อมูลของคุณได้อย่างเที่ยงตรง จัดการกับองค์ประกอบที่ทำซ้ำเช่นอาร์เรย์ และใช้สไตล์ที่กำหนดเองได้อย่างง่ายดาย"
    },
    "feature_4": {
      "title": "เข้ากันได้กับรูปแบบไฟล์หลากหลาย",
      "content": "รวมเอกสารข้ามรูปแบบต่างๆ รวมถึง PDFs, HTML, ไฟล์ MS Office, และ OpenOffice เพื่อให้มั่นใจถึงความยืดหยุ่นสำหรับโครงการของคุณ"
    }
  },
  "formats": {
    "title": "รวมไฟล์ประเภทต่างๆ",
    "description": "ด้วย {{EnvName}} คุณสามารถฝังและรวมเนื้อหาจากรูปแบบไฟล์มากกว่า 50 รูปแบบ ได้อย่างราบรื่นเพื่อสร้างผลลัพธ์ที่เป็นมืออาชีพ"
  },
  "operations": {
    "title": "ความสามารถหลักในภาพรวม",
    "description": "ค้นพบคุณสมบัติที่หลากหลายที่ {{ProdShortName}} มีเพื่อทำให้การฝังและรวมเอกสารเป็นไปอย่างมีประสิทธิภาพและไม่มีปัญหา"
  },
  "examples": {
    "comment_1": "ใช้แท็กนี้ในเทมเพลตของคุณเพื่อทำเครื่องหมายจุดที่จะแทรกเอกสาร",
    "comment_2": "ตั้งค่าที่อยู่ไฟล์สำหรับเทมเพลตหลัก",
    "comment_3": "ระบุที่อยู่ไฟล์สำหรับเอกสารที่คุณต้องการแทรก",
    "comment_4": "บันทึกไฟล์สุดท้ายพร้อมเนื้อหาที่ถูกแทรก"
  },
  "steps": {
    "title": "ขั้นตอนในการแทรกเอกสารลงในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การฝังเอกสาร {{FileFormatUp}} หนึ่งเข้าไปอีกเอกสารหนึ่งเป็นเรื่องง่ายและปรับแต่งได้",
      "step_1": "เตรียมเทมเพลต {{FileFormatUp}} โดยมีพ้อยส์สำหรับเนื้อหาที่ฝังอยู่",
      "step_2": "ระบุที่อยู่ไฟล์สำหรับเทมเพลต",
      "step_3": "ให้ที่อยู่ไฟล์สำหรับเอกสารที่จะฝัง",
      "step_4": "บันทึกไฟล์เอาต์พุตพร้อมเนื้อหาที่ผสม"
    }
  },
  "code_1": {
    "title": "วิธีการแทรกรูปภาพเข้าไปในเอกสารด้วยโปรแกรม",
    "content": "ตัวอย่างนี้แสดงวิธีการฝังรูปภาพลงในไฟล์ {{FileFormatUp}} โดยใช้ {{ProdShortName}}",
    "comment_1": "เพิ่มแท็กแทนในไฟล์เทมเพลต",
    "comment_2": "กำหนดที่อยู่ไฟล์เทมเพลต",
    "comment_3": "ระบุที่อยู่ไฟล์สำหรับรูปภาพ",
    "comment_4": "เริ่มต้นอินสแตนซ์ของ {{DocumentAssembler}}",
    "comment_5": "บันทึกไฟล์ที่มีรูปภาพที่ถูกแทรก"
  },
  "texts_pdf": {
    "step_1": "สร้างเทมเพลตที่มีพ้อยส์สำหรับเนื้อหาที่แทรก (เทมเพลต PDF ไม่มีการสนับสนุนในขณะนี้)",
    "step_4": "บันทึกไฟล์สุดท้ายที่มีเนื้อหาที่รวมกันในรูปแบบ PDF",
    "comment_tmp": "เทมเพลต PDF ไม่ได้รับการสนับสนุนในขณะนี้"
  }
}