{
  "head": {
    "title": "Insert one document into another in {{FileFormatUp}} using {{ProgLang}}",
    "description": "Combine {{FileFormatUp}} files easily with {{ProgLang}}. {{ProdShortName}} simplifies the process of merging documents in just a few lines of code."
  },
  "header": {
    "title": "Embed content into {{FileFormatUp}} files effortlessly",
    "description": "Use {{ProdFullName}} to seamlessly insert one {{FileFormatUp}} document into another. Get precise results with flexible and reliable tools.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Get it for Free"
  },
  "about": {
    "title": "What is {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is a versatile solution for handling documents. It enables you to integrate one document into another with ease, supporting over 50 formats such as PDFs and MS Office files. Tailor your output by merging, editing, and organizing content exactly how you want."
  },
  "more_features": {
    "title": "Advanced tools to simplify document integration",
    "description": "With {{ProdFullName}}, embedding documents is straightforward and customizable, no matter the file type. Achieve clean and consistent results across your projects.",
    "image_description": "Highlights of {{ProdShortName}}",
    "feature_1": {
      "title": "Create reports using business data",
      "content": "Fill documents with data from sources like JSON, XML, or CSV quickly and reliably, streamlining your workflows."
    },
    "feature_2": {
      "title": "Enhance documents with visual content",
      "content": "{{ProdShortName}} lets you insert tables, charts, and lists alongside text, hyperlinks, images, and even dynamic barcodes."
    },
    "feature_3": {
      "title": "Place data exactly where it belongs",
      "content": "LINQ templates help position your data with precision, handle repeating elements like arrays, and apply custom styles effortlessly."
    },
    "feature_4": {
      "title": "Compatible with diverse file formats",
      "content": "Merge documents across various formats, including PDFs, HTML, MS Office files, and OpenOffice, ensuring flexibility for your projects."
    }
  },
  "formats": {
    "title": "Merge across different document types",
    "description": "With {{EnvName}}, you can embed and combine content across more than 50 file formats. Add files seamlessly to create professional results."
  },
  "operations": {
    "title": "Key capabilities at a glance",
    "description": "Discover the extensive features {{ProdShortName}} offers to make embedding and combining documents efficient and hassle-free."
  },
  "examples": {
    "comment_1": "Use this tag in your template to mark the spot for the embedded document",
    "comment_2": "Set the file path for the main template",
    "comment_3": "Provide the path to the document you want to insert",
    "comment_4": "Save the final file with the embedded content"
  },
  "steps": {
    "title": "Steps to insert a document into a {{FileFormatUp}} file",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) makes embedding one {{FileFormatUp}} document into another simple and customizable.",
      "step_1": "Prepare a {{FileFormatUp}} template with placeholders for the embedded content.",
      "step_2": "Specify the file path for the template.",
      "step_3": "Provide the file path for the document to embed.",
      "step_4": "Save the output file with the merged content."
    }
  },
  "code_1": {
    "title": "How to programmatically insert an image into a document",
    "content": "This example shows how to embed an image into a {{FileFormatUp}} file using {{ProdShortName}}.",
    "comment_1": "Add a placeholder tag in the template file",
    "comment_2": "Define the path to the template",
    "comment_3": "Specify the path to the image",
    "comment_4": "Initialize the {{DocumentAssembler}} instance",
    "comment_5": "Save the file with the embedded image"
  },
  "texts_pdf": {
    "step_1": "Create a template with placeholders for the embedded content (PDF templates are not supported).",
    "step_4": "Save the final file with the merged content as a PDF.",
    "comment_tmp": "PDF templates are not supported at the moment."
  }
}
