{
  "head": {
    "title": "Embed one document into another in {{FileFormatUp}} with {{ProgLang}} API",
    "description": "Easily merge {{FileFormatUp}} documents using {{ProgLang}}. With {{ProdShortName}}, combine files seamlessly in just a few steps."
  },
  "header": {
    "title": "Combine documents in {{FileFormatUp}} format",
    "description": "With {{ProdFullName}}, you can quickly embed one {{FileFormatUp}} document into another. This API provides robust tools for precise document merging.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for Free"
  },
  "about": {
    "title": "What is {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is a powerful tool for document composition and manipulation. It allows users to embed one document into another, enabling seamless merging of content. With support for over 50 formats—including PDFs, MS Office files, and more—you can organize, edit, and customize the final output to meet your requirements."
  },
  "more_features": {
    "title": "Streamline document merging with advanced tools",
    "description": "The {{ProdFullName}} library simplifies embedding one document into another, supporting various file formats and offering customization for seamless integration.",
    "image_description": "Key Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Generate reports from your business data",
      "content": "Automatically populate documents with data from JSON, XML, CSV, or other sources, ensuring accurate and efficient workflows."
    },
    "feature_2": {
      "title": "Enrich documents with visual elements",
      "content": "{{ProdShortName}} allows you to include tables, charts, and lists, as well as text, links, images, and dynamically generated barcodes."
    },
    "feature_3": {
      "title": "Precisely place and format data",
      "content": "LINQ-based templates give you control over data placement, let you handle loops for arrays, and allow styling such as color customization."
    },
    "feature_4": {
      "title": "Works with multiple file formats",
      "content": "Easily embed documents into one another across formats like MS Office, PDFs, HTML, OpenOffice, and more."
    }
  },
  "formats": {
    "title": "Merge documents in various formats",
    "description": "With {{EnvName}} API, you can combine documents across more than 50 supported formats. Effortlessly embed files or sections into your final documents."
  },
  "operations": {
    "title": "Discover our powerful tools",
    "description": "Explore the features {{ProdShortName}} offers for embedding and merging documents with precision."
  },
  "examples": {
    "comment_1": "Add this tag to your template to mark the insertion point",
    "comment_2": "Specify the file path for the template",
    "comment_3": "Provide the path of the document to be embedded",
    "comment_4": "Save the merged document"
  },
  "steps": {
    "title": "How to merge a document into a {{FileFormatUp}} file",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) allows you to embed one document into another {{FileFormatUp}} file effortlessly. Merge and customize content with ease.",
      "step_1": "Design a {{FileFormatUp}} template with placeholders for the embedded document.",
      "step_2": "Define the file path for the template.",
      "step_3": "Specify the file path of the document to embed.",
      "step_4": "Save the final file with the embedded content."
    }
  },
  "code_1": {
    "title": "How to embed an image into a document programmatically",
    "content": "This example demonstrates how to insert an image into a {{FileFormatUp}} document using {{ProdShortName}}.",
    "comment_1": "Add a placeholder tag in your template",
    "comment_2": "Specify the file path for the template",
    "comment_3": "Set the path to the image file",
    "comment_4": "Initialize an instance of {{DocumentAssembler}}",
    "comment_5": "Save the document with the embedded image"
  },
  "texts_pdf": {
    "step_1": "Design a template with specific placeholders for the content to be embedded (PDF templates are not supported).",
    "step_4": "Export the completed file with the integrated content as a PDF document.",
    "comment_tmp": "Currently, PDF templates cannot be used."
  }
}
